Algorithm.org
#+TITLE: Algorithm
#+OPTIONS: num:t
#+STARTUP: overview
* Bubble
** Algorithm
each time compare itself with the next, if smaller, exchange them
after each epoch, the biggest will be right localed.
with the cursor moving, always with the so far biggest 
#+begin_src 
A[a] for a -> 0, 1, 2, 3....l
FOR i -> 0, 1, 2...l-2:
    FOR j -> 0, 1, 2...l-2-i:
        IF A[j] > A[j+1]:
            exchange A[j]:A[j+1]
#+end_src

** Python
#+begin_src python  :results output :exports both
  A = [2,5,6,8,45,68,98,42,12,7,156,158,9]
  lang = len(A)
  for i in range(lang-2):
      for j in range(lang-i-1):
          if A[j] > A[j+1]:
              A[j], A[j+1] = A[j+1], A[j]
  print(A)            
#+end_src

#+RESULTS:
: [2, 5, 6, 7, 8, 9, 12, 42, 45, 68, 98, 156, 158]

** java
#+begin_src java  :classname BubbleSorting :results output :exports both
  class BubbleSorting
  {
      public static void main(String[] args)
      {
          int A[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
          int langdu = A.length;

          for (int i = 0; i <= langdu-2; i++) {
              for (int j = 0; j <= langdu-2-i; j++) {
                  if (A[j] > A[j+1]) {
                      int tmp = A[j+1];
                      A[j+1] = A[j];
                      A[j] = tmp;
                  }
              }
          }
          for (int a:A){
              System.out.printf("%d ", a);
          }
      }
  }

#+end_src

#+RESULTS:
: 2 5 6 7 8 9 12 42 45 68 98 156 158 
** C/C++
#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int list[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
    int langdu = sizeof(list) / sizeof(int);

    void swap(int *a, int *b){
      int tmp = *b;
      ,*b = *a;
      ,*a = tmp;
    }

    for (int i = 0; i <= langdu-2; ++i) {
      for ( int j=0; j <= langdu-2-i;++j) {
        if (list[j] > list[j+1]) {
          swap(&list[j], &list[j+1]);
        }
      }
    };

    for (int k = 0; k < langdu; ++k) {
      printf("%d  ",*(list+k));
    }
    return 0;
  }

#+end_src

#+RESULTS:
: 2  5  6  7  8  9  12  42  45  68  98  156  158

* Select
** Algorithm
find the  sofar biggest or smallest one of each epoch at the front of list, 
after each epoch put it to the right place.
#+begin_src 
A[a] for a -> 0, 1, 2....l
FOR i -> 0, 1, 2...l-1:
    FOR j -> 0, 1, 2....l-1-i:
        IF A[j] > A[0]:
            exchange(A[j], A[0])
    exchange(A[0], A[l-1-i])
#+end_src
