Algorithm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-23 Sun 14:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algorithm</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Algorithm</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org573213b">Bubble</a>
<ul>
<li><a href="#orgdfdfce0">Algorithm</a></li>
<li><a href="#orgde683d5">Python</a></li>
<li><a href="#org36f6530">java</a></li>
<li><a href="#orga606d1f">C/C++</a></li>
</ul>
</li>
<li><a href="#org9f4634a">Select</a>
<ul>
<li><a href="#orgd60a690">Algorithm</a></li>
<li><a href="#org3be11d0">Python</a></li>
<li><a href="#org58194c6">Java</a></li>
<li><a href="#org5296f16">C/C++</a></li>
</ul>
</li>
<li><a href="#orgca8f91a">Insert</a>
<ul>
<li><a href="#org859329d">Algorithm</a></li>
<li><a href="#org88b6e00">Python</a></li>
<li><a href="#org6937bb7">Java</a></li>
<li><a href="#org73c09fc">C/C++</a></li>
</ul>
</li>
<li><a href="#orgca8589e">merge</a>
<ul>
<li><a href="#orgd6bca36">Algorithm</a></li>
<li><a href="#org65b0699">Python</a></li>
<li><a href="#org2d367e7">Java</a></li>
<li><a href="#org6414d14">C/C++</a></li>
</ul>
</li>
<li><a href="#org1a1a82e">quick</a>
<ul>
<li><a href="#org2e84578">Algorithm</a></li>
<li><a href="#orge6084bf">Python</a></li>
<li><a href="#orgabb7ea5">Java</a></li>
<li><a href="#org6f8272e">C/C++</a></li>
</ul>
</li>
<li><a href="#org302904b">heap</a>
<ul>
<li><a href="#org6fd75a5">Algorithm</a></li>
<li><a href="#org1962e83">python</a></li>
<li><a href="#org99ddf35">Java</a></li>
<li><a href="#orga023bf7">C/C++</a></li>
<li><a href="#org36b6f45">Typescript</a></li>
</ul>
</li>
<li><a href="#org2c4643e">Shell Sort</a>
<ul>
<li><a href="#orgeab49c8">Algorithm</a></li>
<li><a href="#orge71d51d">Python</a></li>
<li><a href="#org0d5681e">Java</a></li>
<li><a href="#orgcec4f1c">C/C++</a></li>
</ul>
</li>
<li><a href="#org9054861">Redix</a>
<ul>
<li><a href="#org42fc4ac">Description</a></li>
<li><a href="#org1574d7c">Algorithmu</a></li>
</ul>
</li>
<li><a href="#org552d071">Bucket Sort</a>
<ul>
<li><a href="#org47988e6">Algorithm</a></li>
</ul>
</li>
<li><a href="#orgfb9a6dc">Count Sort</a>
<ul>
<li><a href="#org42d6a8a">Algorithm</a></li>
<li><a href="#orga0bc336">Python</a></li>
</ul>
</li>
<li><a href="#orge65a1dd">Dichotomy</a>
<ul>
<li><a href="#org019dc5c">C/C++</a></li>
</ul>
</li>
<li><a href="#orgc24e7a2">HoffmannCode</a>
<ul>
<li><a href="#org0989a78">C/C++</a></li>
</ul>
</li>
<li><a href="#org3cc27aa">JosephusRing</a>
<ul>
<li><a href="#orgc6c99b1">C/C++</a></li>
</ul>
</li>
<li><a href="#orgc946ec7">KMPmachting</a>
<ul>
<li><a href="#org1ddb97b">C/C++</a></li>
<li><a href="#org275f400">C/C++</a></li>
</ul>
</li>
<li><a href="#org13b2fb6">Longest Substring Without Repeating Characters</a>
<ul>
<li><a href="#org2797c6c">python</a></li>
</ul>
</li>
<li><a href="#org55a4c7e">k-way Merge</a>
<ul>
<li><a href="#org926d628">description</a></li>
<li><a href="#orgb49d8f5">Naive merge</a></li>
<li><a href="#org8e2e608">rund merge</a></li>
<li><a href="#orgb4f7272">Heap merge</a></li>
</ul>
</li>
<li><a href="#orge191e5f">Dynamic program</a>
<ul>
<li><a href="#orgcfd96df">Description</a></li>
</ul>
</li>
<li><a href="#orgb9bdf79">Maximum subarray</a>
<ul>
<li><a href="#org519eeb3">blunt force \(O(n^{3})\)</a></li>
<li><a href="#orgdb6b339">iterative based \(O(n^{2})\)</a></li>
<li><a href="#org12ef379">dynamic programmierung \(O(n)\)</a>
<ul>
<li><a href="#org616f937">Algorithm</a></li>
<li><a href="#org9b0c3fd">C/C++</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org82d61e2">maximum submatrix</a>
<ul>
<li><a href="#orgb5d3e04">Brute force solution</a></li>
<li><a href="#orgee544d2">dynamic programmierung</a></li>
</ul>
</li>
<li><a href="#orge80fbc2">Find the sum of a specific value in a list</a>
<ul>
<li><a href="#org3cb1eb7">Python</a>
<ul>
<li><a href="#org4f68138">with recursive</a></li>
<li><a href="#org591b056">without rekursive</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb5e893d">Langest increasing subsequence (LIS)</a>
<ul>
<li><a href="#orgfc2a331">Python</a></li>
</ul>
</li>
<li><a href="#org3861c64">packsack</a>
<ul>
<li><a href="#org815e670">0-1 sack</a></li>
<li><a href="#org7b51555">complete sack</a></li>
<li><a href="#org4587518">bund sack</a></li>
</ul>
</li>
<li><a href="#org7909c5e">Order Statistics</a>
<ul>
<li><a href="#orgc4598bc">description</a></li>
<li><a href="#org0036558">for minimun and maximum</a></li>
<li><a href="#org75ab358">linear approach</a></li>
<li><a href="#org7cfc4d9">complexity</a></li>
</ul>
</li>
<li><a href="#org1cac2f0">Range Minimun Query</a>
<ul>
<li><a href="#org0e819c5">description</a></li>
<li><a href="#org805f1c7">naiv approach</a></li>
<li><a href="#org40988c9">DP naiv approach</a></li>
<li><a href="#orgfbebe2c">addation M approach</a></li>
<li><a href="#orga3c8b61">partional approach</a></li>
<li><a href="#org9e44ade">(\(\pm 1\))RMQ</a></li>
<li><a href="#org279bfd3">(\(\pm 1\))RMQ for LCA in rooted tree</a></li>
<li><a href="#org802b22e">Cartesian tree</a></li>
<li><a href="#org10bd7c5">LCA and RMQ</a></li>
</ul>
</li>
<li><a href="#org64d9e17">Computional Geometry</a>
<ul>
<li><a href="#orge0337a6">Convex combinations</a></li>
<li><a href="#org06be857">Cross Product</a>
<ul>
<li><a href="#orgc09f05a">Application of intersection</a></li>
<li><a href="#org6277286">Application of Polar Angle</a></li>
</ul>
</li>
<li><a href="#org4c2a511">Sweeping</a></li>
<li><a href="#org7b99820">Convex Hull</a>
<ul>
<li><a href="#orge563c96">Graham's Scan</a></li>
<li><a href="#org87f00f6">Jarvis's march</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org573213b" class="outline-2">
<h2 id="org573213b">Bubble</h2>
<div class="outline-text-2" id="text-org573213b">
</div>
<div id="outline-container-orgdfdfce0" class="outline-3">
<h3 id="orgdfdfce0">Algorithm</h3>
<div class="outline-text-3" id="text-orgdfdfce0">
<p>
each time compare itself with the next, if smaller, exchange them
after each epoch, the biggest will be right localed.
with the cursor moving, always with the so far biggest 
</p>
<pre class="example">
A[a] for a -&gt; 0, 1, 2, 3....l
FOR i -&gt; 0, 1, 2...l-2:
    FOR j -&gt; 0, 1, 2...l-2-i:
	IF A[j] &gt; A[j+1]:
	    exchange A[j]:A[j+1]
</pre>
</div>
</div>

<div id="outline-container-orgde683d5" class="outline-3">
<h3 id="orgde683d5">Python</h3>
<div class="outline-text-3" id="text-orgde683d5">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">A</span> = [2,5,6,8,45,68,98,42,12,7,156,158,9]
<span style="font-weight: bold; font-style: italic;">lang</span> = <span style="font-weight: bold;">len</span>(A)
<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(lang-2):
    <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(lang-i-1):
        <span style="font-weight: bold;">if</span> A[j] &gt; A[j+1]:
            A[j], <span style="font-weight: bold; font-style: italic;">A</span>[j+1] = A[j+1], A[j]
<span style="font-weight: bold;">print</span>(A)            
</pre>
</div>

<pre class="example">
[2, 5, 6, 7, 8, 9, 12, 42, 45, 68, 98, 156, 158]

</pre>
</div>
</div>

<div id="outline-container-org36f6530" class="outline-3">
<h3 id="org36f6530">java</h3>
<div class="outline-text-3" id="text-org36f6530">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">BubbleSorting</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = A.length;

        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt;= langdu-2; i++) {
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 0; j &lt;= langdu-2-i; j++) {
                <span style="font-weight: bold;">if</span> (A[j] &gt; A[j+1]) {
                    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = A[j+1];
                    A[j+1] = A[j];
                    A[j] = tmp;
                }
            }
        }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>:A){
            System.out.printf(<span style="font-style: italic;">"%d "</span>, a);
        }
    }
}

</pre>
</div>

<pre class="example">
2 5 6 7 8 9 12 42 45 68 98 156 158 

</pre>
</div>
</div>
<div id="outline-container-orga606d1f" class="outline-3">
<h3 id="orga606d1f">C/C++</h3>
<div class="outline-text-3" id="text-orga606d1f">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">list</span>[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">sizeof</span>(list) / <span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);

  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">swap</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">b</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = *b;
    *b = *a;
    *a = tmp;
  }

  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt;= langdu-2; ++i) {
    <span style="font-weight: bold;">for</span> ( <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span>=0; j &lt;= langdu-2-i;++j) {
      <span style="font-weight: bold;">if</span> (list[j] &gt; list[j+1]) {
        swap(&amp;list[j], &amp;list[j+1]);
      }
    }
  };

  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span> = 0; k &lt; langdu; ++k) {
    printf(<span style="font-style: italic;">"%d  "</span>,*(list+k));
  }
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
2  5  6  7  8  9  12  42  45  68  98  156  158

</pre>
</div>
</div>
</div>

<div id="outline-container-org9f4634a" class="outline-2">
<h2 id="org9f4634a">Select</h2>
<div class="outline-text-2" id="text-org9f4634a">
</div>
<div id="outline-container-orgd60a690" class="outline-3">
<h3 id="orgd60a690">Algorithm</h3>
<div class="outline-text-3" id="text-orgd60a690">
<p>
find the  sofar biggest or smallest one of each epoch at the front of list, 
after each epoch put it to the right place.
</p>
<pre class="example">
A[a] for a -&gt; 0, 1, 2....l
FOR i -&gt; 0, 1, 2...l-1:
    FOR j -&gt; 0, 1, 2....l-1-i:
	IF A[j] &gt; A[0]:
	    exchange(A[j], A[0])
    exchange(A[0], A[l-1-i])
</pre>
</div>
</div>
