Algorithm.org
** Python
#+begin_src ipython :results output :exports both
  A = [2,5,6,8,45,68,98,42,12,7,156,158,9]
  lang = len(A)
  for i in range(lang):
      for j in range(lang-i):
          if A[j] > A[0]:
              A[j], A[0] = A[0], A[j]
      A[0], A[lang-1-i] = A[lang-1-i], A[0]
  print(A)

#+end_src

#+RESULTS:
: [2, 5, 6, 7, 8, 9, 12, 42, 45, 68, 98, 156, 158]

** Java
#+begin_src java :classname SelectSorting :results output :exports both
  class SelectSorting
  {
      public static void main(String[] args)
      {
          int A[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
          int langdu = A.length;
          for (int i = 0; i <= langdu-1; i++) {
              for (int j = 0; j <= langdu-1-i; j++) {
                  if (A[j] > A[0]) {
                      int tmp = A[j];
                      A[j] = A[0];
                      A[0] = tmp;
                  }
              }
              int tmp = A[langdu-1-i];
              A[langdu-1-i] = A[0];
              A[0] = tmp;
          }
          for (int var : A) {
              System.out.printf("%d ", var);
          }
      }
  }

#+end_src

#+RESULTS:
: 2 5 6 7 8 9 12 42 45 68 98 156 158 

** C/C++
#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int list[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
    int langdu = sizeof(list) / sizeof(int);
    int i, j;
    void swap(int *a, int *b){
      int tmp = *b;
      ,*b = *a;
      ,*a = tmp;
    }
    for (i = 0; i <= langdu -1; ++i) {
      for (j = 0; j <= langdu-1-i; ++j) {
        if (list[j] > list[0]) {
          swap(&list[j], &list[0]);
        }
      }
      swap(&list[0], &list[langdu-1-i]);
    }
    for (int k = 0; k < langdu; ++k) {
      printf("%d ",*(list+k));
    }
    return 0;
  }


#+end_src

#+RESULTS:
: 2 5 6 7 8 9 12 42 45 68 98 156 158

* Insert
** Algorithm
#+begin_src 
A[a] for a -> 0, 1, 2....l-1
for i -> 1, 2...l-1:
    value <- A[i]
    index <- i
    while(A[index-1] > value && index > 0)
        A[index] = A[index-1]
        index--        
    A[index] <- value
#+end_src
** Python
#+begin_src python :results output :exports both
  list1 = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19]
  langdu = len(list1)
  for i in range(1, langdu):
      value = list1[i]
      index = i
      while(index > 0 and list1[index-1] > value):
          list1[index] = list1[index-1]
          index -= 1
      list1[index] = value
  print(list1)
#+end_src

#+RESULTS:
: [1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 9, 19, 20, 23, 34, 45, 90, 345, 546, 23465]
** Java 
#+begin_src java :results output :exports both  :classname Inserting
  class Inserting
  {
      public static void main(String[] args)
      {
          int list1 [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
          int langdu = list1.length;
          for (int i = 1; i < langdu; i++) {
              int value = list1[i];
              int index = i;
              while(index > 0 && list1[index-1] > value) {
                  list1[index] = list1[index-1];
                  index--;
              }
              list1[index] = value;
          }
          for (int var :list1) {
              System.out.printf("%d ", var);	    
          }
      }
  }
#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 

