Algorithm.html
<div id="outline-container-org3be11d0" class="outline-3">
<h3 id="org3be11d0">Python</h3>
<div class="outline-text-3" id="text-org3be11d0">
<div class="org-src-container">
<pre class="src src-ipython">A = [2,5,6,8,45,68,98,42,12,7,156,158,9]
lang = len(A)
for i in range(lang):
    for j in range(lang-i):
	if A[j] &gt; A[0]:
	    A[j], A[0] = A[0], A[j]
    A[0], A[lang-1-i] = A[lang-1-i], A[0]
print(A)

</pre>
</div>

<pre class="example">
[2, 5, 6, 7, 8, 9, 12, 42, 45, 68, 98, 156, 158]

</pre>
</div>
</div>

<div id="outline-container-org58194c6" class="outline-3">
<h3 id="org58194c6">Java</h3>
<div class="outline-text-3" id="text-org58194c6">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SelectSorting</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = A.length;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt;= langdu-1; i++) {
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 0; j &lt;= langdu-1-i; j++) {
                <span style="font-weight: bold;">if</span> (A[j] &gt; A[0]) {
                    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = A[j];
                    A[j] = A[0];
                    A[0] = tmp;
                }
            }
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = A[langdu-1-i];
            A[langdu-1-i] = A[0];
            A[0] = tmp;
        }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">var</span> : A) {
            System.out.printf(<span style="font-style: italic;">"%d "</span>, var);
        }
    }
}

</pre>
</div>

<pre class="example">
2 5 6 7 8 9 12 42 45 68 98 156 158 

</pre>
</div>
</div>

<div id="outline-container-org5296f16" class="outline-3">
<h3 id="org5296f16">C/C++</h3>
<div class="outline-text-3" id="text-org5296f16">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">list</span>[] = {2,5,6,8,45,68,98,42,12,7,156,158,9};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">sizeof</span>(list) / <span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; font-style: italic;">j</span>;
  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">swap</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">b</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = *b;
    *b = *a;
    *a = tmp;
  }
  <span style="font-weight: bold;">for</span> (i = 0; i &lt;= langdu -1; ++i) {
    <span style="font-weight: bold;">for</span> (j = 0; j &lt;= langdu-1-i; ++j) {
      <span style="font-weight: bold;">if</span> (list[j] &gt; list[0]) {
        swap(&amp;list[j], &amp;list[0]);
      }
    }
    swap(&amp;list[0], &amp;list[langdu-1-i]);
  }
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span> = 0; k &lt; langdu; ++k) {
    printf(<span style="font-style: italic;">"%d "</span>,*(list+k));
  }
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>

<pre class="example">
2 5 6 7 8 9 12 42 45 68 98 156 158

</pre>
</div>
</div>
</div>

<div id="outline-container-orgca8f91a" class="outline-2">
<h2 id="orgca8f91a">Insert</h2>
<div class="outline-text-2" id="text-orgca8f91a">
</div>
<div id="outline-container-org859329d" class="outline-3">
<h3 id="org859329d">Algorithm</h3>
<div class="outline-text-3" id="text-org859329d">
<pre class="example">
A[a] for a -&gt; 0, 1, 2....l-1
for i -&gt; 1, 2...l-1:
    value &lt;- A[i]
    index &lt;- i
    while(A[index-1] &gt; value &amp;&amp; index &gt; 0)
	A[index] = A[index-1]
	index--        
    A[index] &lt;- value
</pre>
</div>
</div>
<div id="outline-container-org88b6e00" class="outline-3">
<h3 id="org88b6e00">Python</h3>
<div class="outline-text-3" id="text-org88b6e00">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">list1</span> = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19]
<span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">len</span>(list1)
<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, langdu):
    <span style="font-weight: bold; font-style: italic;">value</span> = list1[i]
    <span style="font-weight: bold; font-style: italic;">index</span> = i
    <span style="font-weight: bold;">while</span>(index &gt; 0 <span style="font-weight: bold;">and</span> list1[index-1] &gt; value):
        <span style="font-weight: bold; font-style: italic;">list1</span>[index] = list1[index-1]
        <span style="font-weight: bold; font-style: italic;">index</span> -= 1
    <span style="font-weight: bold; font-style: italic;">list1</span>[index] = value
<span style="font-weight: bold;">print</span>(list1)
</pre>
</div>

<pre class="example">
[1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 9, 19, 20, 23, 34, 45, 90, 345, 546, 23465]

</pre>
</div>
</div>
<div id="outline-container-org6937bb7" class="outline-3">
<h3 id="org6937bb7">Java</h3>
<div class="outline-text-3" id="text-org6937bb7">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Inserting</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">list1</span> [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = list1.length;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt; <span style="font-weight: bold; text-decoration: underline;">langdu</span>; i++) {
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span> = list1[i];
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = i;
            <span style="font-weight: bold;">while</span>(index &gt; 0 &amp;&amp; list1[index-1] &gt; value) {
                list1[index] = list1[index-1];
                index--;
            }
            list1[index] = value;
        }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">var</span> :list1) {
            System.out.printf(<span style="font-style: italic;">"%d "</span>, var);          
        }
    }
}
</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 

</pre>
</div>
</div>
