Algorithm.org
** C/C++
#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
    int langdu = sizeof(A)/sizeof(int);
    for (int i = 1; i < langdu; ++i) {
      int value = A[i];
      int index = i;
      while (index > 0 && A[index-1] > value) {
        A[index] = A[index-1];
        index--;
      }
      A[index] = value;
    }
    for (int i = 0; i < langdu; ++i) {
      printf("%d ",A[i] );
    }
    return 0;
  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465

#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
    int langdu = sizeof(A)/sizeof(int);
    insert(A, langdu);
    for (int i = 0; i < langdu; ++i) {
      printf("%d ",A[i] );
    }
    return 0;
  }
  void insert(int A[], int langdu){
    for (int i = 1; i < langdu; ++i) {
      int value = A[i];
      int index = i;
      while (index > 0 && A[index-1] > value) {
        A[index] = A[index-1];
        index--;
      }
      A[index] = value;
    }
    return;

  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465

* merge
** Algorithm
#+begin_src 
A[a] for a -> 0, 1, 2.....l-1
ll = 0
rr = l-1
mergersort(A, ll, rr)

mergersort(A, ll, rr)
  solang ll < rr
    dd = (ll+rr)/2
    A1[a] for a-> ll...dd
    A2[a] for a -> dd+1..rr
    mergersort(A1, ll, dd)
    mergersort(A2, dd+1, rr)
    merge(A1, ll, dd, A2, dd+1, rr)
  else return

merge(A1, A2)
  A1[i] for i -> 0...I
  A2[j] for j -> 0...J
  C[k]  for k -> 0....I+J
  if A1[i] > A2[j] && i < I && j < J
    C[k] <- A2[j]
    k++
    j++
  if i < I
  C[k...k+(I-i)] <- A1[i...I]
  if J < J
  C[k...k+(J-j)] <- A2[j...J]
#+end_src

#+begin_src 
A[a] for a -> 0, 1, 2....l-1
mergersort(A)

mergersort(A):
  if len(A) > 1:
    A1, A2 <- A
    A1 =  mergersort(A1)
    A2 =  mergersort(A2)
    return  merge(A1, A2)
  else return A
merge(A1, A2):
  A1[i] for i -> 0...I
  A2[j] for j -> 0...J
  C[k] for k -> 0...I+J
  while i < I and j < J:
    if A1[i] > A2[j]:
      C[k] <- A2[j]
      j++
    else C[k] <- A1[i]
      i++
    k++
  while i <= I
   C[k] <- A1[i]
  while j <= J
  C[k] <- A2[j]
 return C

#+end_src
** Python
#+begin_src ipython :results output :exports both
  def mergesort(list1):
      if len(list1) <= 1:
          return list1
      mid = int(len(list1)/2)
      lista = list1[:mid]
      listb = list1[mid:]
      lista = mergesort(lista)
      listb = mergesort(listb)
      return merge(lista, listb)

  def merge(lista, listb):
      result = []
      i = 0
      j = 0
      while(i < len(lista) and j < len(listb)):
          if lista[i] > listb[j]:
              result.append(listb[j])
              j += 1
          else:
              result.append(lista[i])
              i += 1
      result += lista[i:]
      result += listb[j:]
      return result
  list1 = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19]
  langdu = len(list1)
  list1 = mergesort(list1)
  print(list1)
#+end_src

#+RESULTS:
: [1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 9, 19, 20, 23, 34, 45, 90, 345, 546, 23465]

