Algorithm.html

<div id="outline-container-org73c09fc" class="outline-3">
<h3 id="org73c09fc">C/C++</h3>
<div class="outline-text-3" id="text-org73c09fc">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">sizeof</span>(A)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt; langdu; ++i) {
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span> = A[i];
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = i;
    <span style="font-weight: bold;">while</span> (index &gt; 0 &amp;&amp; A[index-1] &gt; value) {
      A[index] = A[index-1];
      index--;
    }
    A[index] = value;
  }
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; langdu; ++i) {
    printf(<span style="font-style: italic;">"%d "</span>,A[i] );
  }
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465

</pre>

<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">sizeof</span>(A)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  insert(A, langdu);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; langdu; ++i) {
    printf(<span style="font-style: italic;">"%d "</span>,A[i] );
  }
  <span style="font-weight: bold;">return</span> 0;
}
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">insert</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span>){
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt; langdu; ++i) {
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span> = A[i];
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = i;
    <span style="font-weight: bold;">while</span> (index &gt; 0 &amp;&amp; A[index-1] &gt; value) {
      A[index] = A[index-1];
      index--;
    }
    A[index] = value;
  }
  <span style="font-weight: bold;">return</span>;

}

</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465

</pre>
</div>
</div>
</div>

<div id="outline-container-orgca8589e" class="outline-2">
<h2 id="orgca8589e">merge</h2>
<div class="outline-text-2" id="text-orgca8589e">
</div>
<div id="outline-container-orgd6bca36" class="outline-3">
<h3 id="orgd6bca36">Algorithm</h3>
<div class="outline-text-3" id="text-orgd6bca36">
<pre class="example">
A[a] for a -&gt; 0, 1, 2.....l-1
ll = 0
rr = l-1
mergersort(A, ll, rr)

mergersort(A, ll, rr)
  solang ll &lt; rr
    dd = (ll+rr)/2
    A1[a] for a-&gt; ll...dd
    A2[a] for a -&gt; dd+1..rr
    mergersort(A1, ll, dd)
    mergersort(A2, dd+1, rr)
    merge(A1, ll, dd, A2, dd+1, rr)
  else return

merge(A1, A2)
  A1[i] for i -&gt; 0...I
  A2[j] for j -&gt; 0...J
  C[k]  for k -&gt; 0....I+J
  if A1[i] &gt; A2[j] &amp;&amp; i &lt; I &amp;&amp; j &lt; J
    C[k] &lt;- A2[j]
    k++
    j++
  if i &lt; I
  C[k...k+(I-i)] &lt;- A1[i...I]
  if J &lt; J
  C[k...k+(J-j)] &lt;- A2[j...J]
</pre>

<pre class="example">
A[a] for a -&gt; 0, 1, 2....l-1
mergersort(A)

mergersort(A):
  if len(A) &gt; 1:
    A1, A2 &lt;- A
    A1 =  mergersort(A1)
    A2 =  mergersort(A2)
    return  merge(A1, A2)
  else return A
merge(A1, A2):
  A1[i] for i -&gt; 0...I
  A2[j] for j -&gt; 0...J
  C[k] for k -&gt; 0...I+J
  while i &lt; I and j &lt; J:
    if A1[i] &gt; A2[j]:
      C[k] &lt;- A2[j]
      j++
    else C[k] &lt;- A1[i]
      i++
    k++
  while i &lt;= I
   C[k] &lt;- A1[i]
  while j &lt;= J
  C[k] &lt;- A2[j]
 return C

</pre>
</div>
</div>
<div id="outline-container-org65b0699" class="outline-3">
<h3 id="org65b0699">Python</h3>
<div class="outline-text-3" id="text-org65b0699">
<div class="org-src-container">
<pre class="src src-ipython">def mergesort(list1):
    if len(list1) &lt;= 1:
	return list1
    mid = int(len(list1)/2)
    lista = list1[:mid]
    listb = list1[mid:]
    lista = mergesort(lista)
    listb = mergesort(listb)
    return merge(lista, listb)

def merge(lista, listb):
    result = []
    i = 0
    j = 0
    while(i &lt; len(lista) and j &lt; len(listb)):
	if lista[i] &gt; listb[j]:
	    result.append(listb[j])
	    j += 1
	else:
	    result.append(lista[i])
	    i += 1
    result += lista[i:]
    result += listb[j:]
    return result
list1 = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19]
langdu = len(list1)
list1 = mergesort(list1)
print(list1)
</pre>
</div>

<pre class="example">
[1, 2, 3, 3, 4, 4, 5, 6, 7, 8, 9, 9, 19, 20, 23, 34, 45, 90, 345, 546, 23465]

</pre>
</div>
</div>
