Algorithm.org
** Java
mit index augenment
#+begin_src java :classname Merging :results output :exports both
  import java.util.*;
  class Merging
  {
      public static void main(String[] args)
      {
          int a [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
          int langdu = a.length-1;
          mergsort(a, 0, langdu );
          for(int var : a){
              System.out.printf("%d ", var);
          }
      }
      private static void mergsort(int [] a, int lo, int hi){
          if (lo >= hi) {
              return;
          }
          int mid = lo + (hi-lo)/2;
          mergsort(a, lo, mid);
          mergsort(a, mid+1, hi);
          merge(a, lo, mid, hi);
      }
      private static void merge(int [] a, int lo, int mid, int hi){
          int [] news = new int [hi-lo+1];
          int p = lo;
          int q = mid+1;
          int index = 0;
          while(p <= mid && q <= hi){
              if (a[p] > a[q]) {
                  news[index++] = a[q++];
              }else{
                  news[index++] = a[p++];
              }
          }
          while(p <= mid){
              news[index++] = a[p++];
          }

          while(q <= hi){
              news[index++] = a[q++];
          }
          System.arraycopy(news, 0, a, lo, hi-lo+1);
      }
  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 
without index augenment
#+begin_src java :classname Merginge :results output :exports both
  import java.util.*;
  class Merginge
  {
      public static void main(String[] args)
      {
          int a [] = {2, 1, 3, 4, 5, 9, 7, 8, 6, 10, 2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
          int [] result = mergsort(a);
          for(int var : result){
              System.out.printf("%d ", var);
          }
      }
      private static int [] mergsort(int [] a){
          if (a.length <= 1) {
              return a;
          }
          int mid = a.length/2;
          int [] left = new int [mid];
          int [] right = new int [a.length - mid];
          for (int i = 0; i < mid; i++) {
              left[i] = a[i];
                  }
          for (int i = mid; i < a.length; i++) {
              right[i-mid] = a[i];
                  }
          left = mergsort(left);
          right = mergsort(right);
          return merge(left, right);
      }
      private static int[] merge(int [] left, int [] right){
          int lenleft = left.length-1;
          int leftindex = 0;
          int lenright = right.length-1;
          int rightindex = 0;
          int [] result = new int[lenleft+lenright+2];
          int index = 0;
          while(leftindex <= lenleft && rightindex <= lenright){
              if (left[leftindex] > right[rightindex]) {
                  result[index++] = right[rightindex++];
              }else{
                  result[index++] = left[leftindex++];
              }
          }
          while(leftindex <= lenleft){
              result[index++] = left[leftindex++];
          }
          while(rightindex <= lenright){
              result[index++] = right[rightindex++];
          }
          return result;
      }
  }

#+end_src

#+RESULTS:
: 1 1 2 2 3 3 3 4 4 4 5 5 6 6 7 7 8 8 9 9 9 10 19 20 23 34 45 90 345 546 23465 

