Algorithm.html

<div id="outline-container-org2d367e7" class="outline-3">
<h3 id="org2d367e7">Java</h3>
<div class="outline-text-3" id="text-org2d367e7">
<p>
mit index augenment
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.*;
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Merging</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = a.length-1;
        mergsort(a, 0, langdu );
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">var</span> : a){
            System.out.printf(<span style="font-style: italic;">"%d "</span>, var);
        }
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">mergsort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">lo</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">hi</span>){
        <span style="font-weight: bold;">if</span> (lo &gt;= hi) {
            <span style="font-weight: bold;">return</span>;
        }
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span> = lo + (hi-lo)/2;
        mergsort(a, lo, mid);
        mergsort(a, mid+1, hi);
        merge(a, lo, mid, hi);
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">lo</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">hi</span>){
        <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">news</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span> [hi-lo+1];
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">p</span> = lo;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">q</span> = mid+1;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = 0;
        <span style="font-weight: bold;">while</span>(p &lt;= mid &amp;&amp; q &lt;= hi){
            <span style="font-weight: bold;">if</span> (a[p] &gt; a[q]) {
                news[index++] = a[q++];
            }<span style="font-weight: bold;">else</span>{
                news[index++] = a[p++];
            }
        }
        <span style="font-weight: bold;">while</span>(p &lt;= mid){
            news[index++] = a[p++];
        }

        <span style="font-weight: bold;">while</span>(q &lt;= hi){
            news[index++] = a[q++];
        }
        System.arraycopy(news, 0, a, lo, hi-lo+1);
    }
}

</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 

</pre>
<p>
without index augenment
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.*;
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Merginge</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> [] = {2, 1, 3, 4, 5, 9, 7, 8, 6, 10, 2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
        <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">result</span> = mergsort(a);
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">var</span> : result){
            System.out.printf(<span style="font-style: italic;">"%d "</span>, var);
        }
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold;">mergsort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">a</span>){
        <span style="font-weight: bold;">if</span> (a.length &lt;= 1) {
            <span style="font-weight: bold;">return</span> a;
        }
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span> = a.length/2;
        <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">left</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span> [mid];
        <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">right</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span> [a.length - mid];
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold; text-decoration: underline;">mid</span>; i++) {
            left[i] = a[i];
                }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = mid; i &lt; a.<span style="font-weight: bold; text-decoration: underline;">length</span>; i++) {
            right[i-mid] = a[i];
                }
        left = mergsort(left);
        right = mergsort(right);
        <span style="font-weight: bold;">return</span> merge(left, right);
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[] <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">left</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">right</span>){
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">lenleft</span> = left.length-1;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">leftindex</span> = 0;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">lenright</span> = right.length-1;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">rightindex</span> = 0;
        <span style="font-weight: bold; text-decoration: underline;">int</span> [] <span style="font-weight: bold; font-style: italic;">result</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[lenleft+lenright+2];
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = 0;
        <span style="font-weight: bold;">while</span>(leftindex &lt;= lenleft &amp;&amp; rightindex &lt;= lenright){
            <span style="font-weight: bold;">if</span> (left[leftindex] &gt; right[rightindex]) {
                result[index++] = right[rightindex++];
            }<span style="font-weight: bold;">else</span>{
                result[index++] = left[leftindex++];
            }
        }
        <span style="font-weight: bold;">while</span>(leftindex &lt;= lenleft){
            result[index++] = left[leftindex++];
        }
        <span style="font-weight: bold;">while</span>(rightindex &lt;= lenright){
            result[index++] = right[rightindex++];
        }
        <span style="font-weight: bold;">return</span> result;
    }
}

</pre>
</div>

<pre class="example">
1 1 2 2 3 3 3 4 4 4 5 5 6 6 7 7 8 8 9 9 9 10 19 20 23 34 45 90 345 546 23465 

</pre>
</div>
</div>
