Algorithm.org
** C/C++
#+begin_src C :results output :exports both
  #include <stdio.h>
  #include <stdlib.h>
  #define N 7
  void merge(int arr[], int low, int mid, int high){
      int i, k;
      int *tmp = (int *)malloc((high-low+1)*sizeof(int));
      int left_low = low;
      int left_high = mid;
      int right_low = mid + 1;
      int right_high = high;
      for(k=0; left_low<=left_high && right_low<=right_high; k++){
          if(arr[left_low]<=arr[right_low]){
              tmp[k] = arr[left_low++];
          }else{
              tmp[k] = arr[right_low++];
          }
      }
      if(left_low <= left_high){  
        for(i=left_low;i<=left_high;i++)
          tmp[k++] = arr[i];
      }
      if(right_low <= right_high){
        for(i=right_low; i<=right_high; i++)
          tmp[k++] = arr[i];
      }
      for(i=0; i<high-low+1; i++)
          arr[low+i] = tmp[i];
      free(tmp);
      return;
  }
  void merge_sort(int arr[], unsigned int first, unsigned int last){
      int mid = 0;
      if(first<last){
          mid = (first+last)/2; /* 注意防止溢出 */
          merge_sort(arr, first, mid);
          merge_sort(arr, mid+1,last);
          merge(arr,first,mid,last);
      }
      return;
  }
  int main(){
      int i;
      int a[N]={32,12,56,78,76,45,36};
      printf ("排序前 \n");
      for(i=0;i<N;i++)
          printf("%d\t",a[i]);
      merge_sort(a,0,N-1);  // 排序
      printf ("\n 排序后 \n");
      for(i=0;i<N;i++)
          printf("%d\t",a[i]); printf("\n");
      system("pause");
      return 0;
  }

#+end_src

#+RESULTS:
: 排序前 
: 32	12	56	78	76	45	36	
:  排序后 
: 12	32	36	45	56	76	78

* quick
** Algorithm
#+begin_src 
A[a] for a -> 0, 1, 2...l-1:
quicksort(A, 0, l-1)

quicksort(A, start, end):
  if  start >= end:
    return;
  else:
    pivot = A[start]
    int i = start
    int j = end
    while(i != j):
      whil (j > i && A[j] > pivot):
          j--
      exchange(A[i], A[j])
      while(i < j && A[i] < pivot):
          i++
      exchange(A[i], A[j])

    quicksort(A, start, i+1)
    quicksort(A, i+1, end)

#+end_src
** Python
#+begin_src ipython :results output :exports both
def quicksort(A, start, end):
    if start >= end:
        return
    pivot = A[start]
    i = start
    j = end
    while i != j:
        while j > i and A[j] >= pivot:
            j -= 1
        A[i], A[j] = A[j], A[i]
        while i < j and A[i] <= pivot:
            i += 1
        A[i], A[j] = A[j], A[i]
    quicksort(A, start, j-1)
    quicksort(A, i+1, end)
    return



list1 = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25,
         34, 23, 345, 546, 20, 23465, 90, 19]
langdu = len(list1)
quicksort(list1, 0, langdu-1)
print(list1)
#+end_src

#+RESULTS:
: [1, 2, 3, 3, 4, 5, 5, 7, 8, 9, 19, 20, 23, 25, 34, 45, 90, 345, 546, 23465]

** Java
#+begin_src java :classname Quicking :results output :exports both
  class Quicking
  {
      public static void main(String[] args)
      {
          int a [] = {2, 1, 3, 4, 5,9087, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
          int langdu = a.length-1;
          quicksort(a, 0, langdu);
          for (int var: a) {
              System.out.printf("%d ", var);
          }
      }
      private static void quicksort(int [] a, int start, int end ){
          if (start >= end) {
              return;
          }
          int pivot = a[start];
          int i = start;
          int j = end;
          while(i != j){
              while(j > i && a[j] >= pivot){
                  j--;
              }
              int tmp = a[j];
              a[j] = a[i];
              a[i] = tmp;
              while(i < j && a[i] <= pivot){
                  i++;
              }
              tmp = a[j];
              a[j] = a[i];
              a[i] = tmp;
          }
          quicksort(a, start, i-1);
          quicksort(a, i+1, end);
      }
  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 9087 23465 

