Algorithm.html

<div id="outline-container-org6414d14" class="outline-3">
<h3 id="org6414d14">C/C++</h3>
<div class="outline-text-3" id="text-org6414d14">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">N</span> 7
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">arr</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">low</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">high</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; font-style: italic;">k</span>;
    <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">tmp</span> = (<span style="font-weight: bold; text-decoration: underline;">int</span> *)malloc((high-low+1)*<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>));
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">left_low</span> = low;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">left_high</span> = mid;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">right_low</span> = mid + 1;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">right_high</span> = high;
    <span style="font-weight: bold;">for</span>(k=0; left_low&lt;=left_high &amp;&amp; right_low&lt;=right_high; k++){
        <span style="font-weight: bold;">if</span>(arr[left_low]&lt;=arr[right_low]){
            tmp[k] = arr[left_low++];
        }<span style="font-weight: bold;">else</span>{
            tmp[k] = arr[right_low++];
        }
    }
    <span style="font-weight: bold;">if</span>(left_low &lt;= left_high){  
      <span style="font-weight: bold;">for</span>(i=left_low;i&lt;=left_high;i++)
        tmp[k++] = arr[i];
    }
    <span style="font-weight: bold;">if</span>(right_low &lt;= right_high){
      <span style="font-weight: bold;">for</span>(i=right_low; i&lt;=right_high; i++)
        tmp[k++] = arr[i];
    }
    <span style="font-weight: bold;">for</span>(i=0; i&lt;high-low+1; i++)
        arr[low+i] = tmp[i];
    free(tmp);
    <span style="font-weight: bold;">return</span>;
}
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">merge_sort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">arr</span>[], <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">first</span>, <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">last</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span> = 0;
    <span style="font-weight: bold;">if</span>(first&lt;last){
        mid = (first+last)/2; <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">&#27880;&#24847;&#38450;&#27490;&#28322;&#20986; </span><span style="font-weight: bold; font-style: italic;">*/</span>
        merge_sort(arr, first, mid);
        merge_sort(arr, mid+1,last);
        merge(arr,first,mid,last);
    }
    <span style="font-weight: bold;">return</span>;
}
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>[N]={32,12,56,78,76,45,36};
    printf (<span style="font-style: italic;">"&#25490;&#24207;&#21069; \n"</span>);
    <span style="font-weight: bold;">for</span>(i=0;i&lt;N;i++)
        printf(<span style="font-style: italic;">"%d\t"</span>,a[i]);
    merge_sort(a,0,N-1);  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#25490;&#24207;</span>
    printf (<span style="font-style: italic;">"\n &#25490;&#24207;&#21518; \n"</span>);
    <span style="font-weight: bold;">for</span>(i=0;i&lt;N;i++)
        printf(<span style="font-style: italic;">"%d\t"</span>,a[i]); printf(<span style="font-style: italic;">"\n"</span>);
    system(<span style="font-style: italic;">"pause"</span>);
    <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
排序前 
32	12	56	78	76	45	36	
 排序后 
12	32	36	45	56	76	78

</pre>
</div>
</div>
</div>

<div id="outline-container-org1a1a82e" class="outline-2">
<h2 id="org1a1a82e">quick</h2>
<div class="outline-text-2" id="text-org1a1a82e">
</div>
<div id="outline-container-org2e84578" class="outline-3">
<h3 id="org2e84578">Algorithm</h3>
<div class="outline-text-3" id="text-org2e84578">
<pre class="example">
A[a] for a -&gt; 0, 1, 2...l-1:
quicksort(A, 0, l-1)

quicksort(A, start, end):
  if  start &gt;= end:
    return;
  else:
    pivot = A[start]
    int i = start
    int j = end
    while(i != j):
      whil (j &gt; i &amp;&amp; A[j] &gt; pivot):
	  j--
      exchange(A[i], A[j])
      while(i &lt; j &amp;&amp; A[i] &lt; pivot):
	  i++
      exchange(A[i], A[j])

    quicksort(A, start, i+1)
    quicksort(A, i+1, end)

</pre>
</div>
</div>
<div id="outline-container-orge6084bf" class="outline-3">
<h3 id="orge6084bf">Python</h3>
<div class="outline-text-3" id="text-orge6084bf">
<div class="org-src-container">
<pre class="src src-ipython">def quicksort(A, start, end):
    if start &gt;= end:
	return
    pivot = A[start]
    i = start
    j = end
    while i != j:
	while j &gt; i and A[j] &gt;= pivot:
	    j -= 1
	A[i], A[j] = A[j], A[i]
	while i &lt; j and A[i] &lt;= pivot:
	    i += 1
	A[i], A[j] = A[j], A[i]
    quicksort(A, start, j-1)
    quicksort(A, i+1, end)
    return



list1 = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25,
	 34, 23, 345, 546, 20, 23465, 90, 19]
langdu = len(list1)
quicksort(list1, 0, langdu-1)
print(list1)
</pre>
</div>

<pre class="example">
[1, 2, 3, 3, 4, 5, 5, 7, 8, 9, 19, 20, 23, 25, 34, 45, 90, 345, 546, 23465]

</pre>
</div>
</div>
