Algorithm.org
** C/C++
#+begin_src C :results output :exports both
    void swap(int *a, int *b){
      int tmp = *b;
      ,*b = *a;
      ,*a = tmp;
    }

    void quicksort(int a[], int start, int end){
      if (start >= end) {
        return;
      }
      int pivot = a[start];
      int i = start;
      int j = end;
      while (i != j) {
        while (j > i && a[j] > pivot) 
          j--;
        swap(&a[i], &a[j]);
        while (i < j && a[i] < pivot) 
          i++;
        swap(&a[i], &a[j]);
        quicksort(a, start, i-1);
        quicksort(a, i+1, end);
        return;
      }
    }

  int main(int argc, char *argv[])
  {
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 190};
    int langdu = sizeof(A)/sizeof(int);
    quicksort(A, 0, langdu-1);
    for (int i = 0; i < langdu; ++i) {
      printf("%d ", A[i]);
    }
    return 0;
  }
#+end_src

#+RESULTS:
: 1 2 3 4 3 4 5 6 7 8 9 9 20 23 34 45 190 345 546 90 23465

* heap
** Algorithm
|---------------------+-----------------------------------------------------------|
| build_heap()        | build all the data to heap                                |
| heapify(list, n, i) | from i on, can only grante that, the frist is the biggest |
|---------------------+-----------------------------------------------------------|
at frist build the heap, and then each time take the biggest one
n:length, i the startup
#+begin_src 
heapify(list, n, i){  
  leftchild = 2i+1
  rightchild = 2i+2
  maxindex = i
  if leftchild < n && list[leftchild] > list[maxindex]:
    maxindex = leftchild
  if rightchild < n && list[rightchild] > list[maxindex]:
    maxindex = rightchild
  if maxindex != i:
    exchange(list[maxindex], list[i])
    heapify(list, n, maxindex)
  }
build_heap(list, n){
  last_parent = (n-1)/2
  for i -> last_parent....0:
    heapify(list, n, i) 
  }


build_heap(list, n)
for i -> n-1....0:
  swap(list, i, 0)
  heapify(list, i, 0)

#+end_src
** python
#+begin_src ipython :results output :exports both
  def heapify(list1, n, i):
      leftchild = 2*i+1
      rightchild = 2*i +2
      maxindex = i
      if leftchild < n and list1[leftchild] > list1[maxindex]:
          maxindex = leftchild
      if rightchild < n and list1[rightchild] > list1[maxindex]:
          maxindex = rightchild
      if maxindex != i:
          list1[maxindex], list1[i] = list1[i], list1[maxindex]
          heapify(list1, n, maxindex)

  def heap_build(list1, n):
      last_parent = (n-1)//2
      for i in range(last_parent+1):
          j = last_parent-i
          heapify(list1, n, j)


  list1 = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19]
  langdu = len(list1)
  heap_build(list1, langdu)
  print(list1)
  for i in range(langdu):
      j = langdu-1-i
      list1[0], list1[j] = list1[j], list1[0]
      heapify(list1, j, 0)

  print(list1)

#+end_src

#+RESULTS:
: [23465, 546, 345, 90, 45, 34, 23, 20, 8, 19, 9, 25, 3, 3, 5, 7, 1, 2, 4, 5]
: [1, 2, 3, 3, 4, 5, 5, 7, 8, 9, 19, 20, 23, 25, 34, 45, 90, 345, 546, 23465]

