Algorithm.org
** Java
#+begin_src  java :classname HeapSorting :results output :exports both
  class HeapSorting
  {
      public static void main(String[] args)
      {
          int a [] = {2, 1, 3, 4, 5,9087, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 190};
          int langdu = a.length;
          build_heap(a, langdu);
          for (int i = langdu-1; i >= 0; i--) {
              int tmp = a[0];
              a[0] = a[i];
              a[i] = tmp;
              heapify(a, i, 0);
          }
          for (int i = 0; i < langdu; i++) {
              System.out.printf("%d ", a[i]);
          }
      }
      private static void heapify(int a[], int n, int i){
          int leftchild = i*2+1;
          int rightchild = i*2+2;
          int maxindex = i;
          if (leftchild < n && a[leftchild] > a[maxindex] ) {
              maxindex = leftchild;
          }
          if (rightchild < n && a[rightchild] > a[maxindex]) {
              maxindex = rightchild;
          }
          if (maxindex != i) {
              int tmp = a[maxindex];
              a[maxindex] = a[i];
              a[i] = tmp;
              heapify(a, n, maxindex);
          }
      }
      private static void build_heap(int a[], int n){
          int last_parent = (n-1-1)/2;
          for (int i = last_parent; i >= 0; i--) {
              heapify(a, n, i);
          }
      }
  }
#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 20 23 34 45 90 190 345 546 9087 23465 

** C/C++
#+begin_src C :results output :exports both 
    void swap(int *a, int *b){
      int tmp = *a;
      ,*a = *b;
      ,*b = tmp;
    }
    void heapify(int A[], int N, int i){
      int leftchild = i*2+1;
      int rightchild = i*2+2;
      int maxindex = i;
      if (leftchild < N && A[leftchild] > A[maxindex]) {
        maxindex = leftchild;
      }
      if (rightchild < N && A[rightchild] > A[maxindex]) {
        maxindex = rightchild;
      }
      if (maxindex != i) {
        swap(&A[maxindex], &A[i]);
        heapify(A, N, maxindex);
      }
    }

    void build_heap(int A[], int N){
      int last_parent = (N-1-1)/2;
      int i;
      for (i = last_parent; i >= 0; i--) {
        heapify(A, N, i);
      }
    }

  int main(int argc, char *argv[])
  {
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 190};
    int N = sizeof(A)/sizeof(int);
    build_heap(A, N);
    for (int i = N-1; i >= 0; i--) {
      swap(&A[i], &A[0]);
      heapify(A, i, 0);
    }

    for (int j = 0; j < N; ++j) {
      printf("%d ",A[j]);
    }
    return 0;
  }


#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 20 23 34 45 90 190 345 546 23465
