Algorithm.html

<div id="outline-container-org99ddf35" class="outline-3">
<h3 id="org99ddf35">Java</h3>
<div class="outline-text-3" id="text-org99ddf35">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">HeapSorting</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> [] = {2, 1, 3, 4, 5,9087, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 190};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = a.length;
        build_heap(a, langdu);
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = langdu-1; i &gt;= 0; i--) {
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = a[0];
            a[0] = a[i];
            a[i] = tmp;
            heapify(a, i, 0);
        }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold; text-decoration: underline;">langdu</span>; i++) {
            System.out.printf(<span style="font-style: italic;">"%d "</span>, a[i]);
        }
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">heapify</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>){
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">leftchild</span> = i*2+1;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">rightchild</span> = i*2+2;
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">maxindex</span> = i;
        <span style="font-weight: bold;">if</span> (leftchild &lt; <span style="font-weight: bold; text-decoration: underline;">n</span> &amp;&amp; a[leftchild] &gt; a[maxindex] ) {
            maxindex = leftchild;
        }
        <span style="font-weight: bold;">if</span> (rightchild &lt; <span style="font-weight: bold; text-decoration: underline;">n</span> &amp;&amp; a[rightchild] &gt; a[maxindex]) {
            maxindex = rightchild;
        }
        <span style="font-weight: bold;">if</span> (maxindex != i) {
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = a[maxindex];
            a[maxindex] = a[i];
            a[i] = tmp;
            heapify(a, n, maxindex);
        }
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">build_heap</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>){
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">last_parent</span> = (n-1-1)/2;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = last_parent; i &gt;= 0; i--) {
            heapify(a, n, i);
        }
    }
}
</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 20 23 34 45 90 190 345 546 9087 23465 

</pre>
</div>
</div>

<div id="outline-container-orga023bf7" class="outline-3">
<h3 id="orga023bf7">C/C++</h3>
<div class="outline-text-3" id="text-orga023bf7">
<div class="org-src-container">
<pre class="src src-C">  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">swap</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">b</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">tmp</span> = *a;
    *a = *b;
    *b = tmp;
  }
  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">heapify</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">leftchild</span> = i*2+1;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">rightchild</span> = i*2+2;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">maxindex</span> = i;
    <span style="font-weight: bold;">if</span> (leftchild &lt; N &amp;&amp; A[leftchild] &gt; A[maxindex]) {
      maxindex = leftchild;
    }
    <span style="font-weight: bold;">if</span> (rightchild &lt; N &amp;&amp; A[rightchild] &gt; A[maxindex]) {
      maxindex = rightchild;
    }
    <span style="font-weight: bold;">if</span> (maxindex != i) {
      swap(&amp;A[maxindex], &amp;A[i]);
      heapify(A, N, maxindex);
    }
  }

  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">build_heap</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">last_parent</span> = (N-1-1)/2;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>;
    <span style="font-weight: bold;">for</span> (i = last_parent; i &gt;= 0; i--) {
      heapify(A, N, i);
    }
  }

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 190};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">sizeof</span>(A)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  build_heap(A, N);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = N-1; i &gt;= 0; i--) {
    swap(&amp;A[i], &amp;A[0]);
    heapify(A, i, 0);
  }

  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 0; j &lt; N; ++j) {
    printf(<span style="font-style: italic;">"%d "</span>,A[j]);
  }
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 20 23 34 45 90 190 345 546 23465

</pre>
</div>
</div>
