Algorithm.org
** Typescript
swap in-place
#+begin_src typescript :exports both :results both
  // let swap = function (left:number, right:number){
  //       var temp = left
  //       left = right
  //       right = temp
  //   }

  let heapfly =  function(list:number[], length:number, index:number){
        var leftchild = index*2+1
        var rightchild = index*2+2
        var maxindex = index
        if (leftchild < length && list[leftchild] >list[maxindex]) {
            let temp = leftchild
            leftchild = maxindex
            maxindex = temp
  //          swap(leftchild, minindex)
        }

      if (rightchild < length && list[rightchild]>list[maxindex]) {
          let tmp = rightchild
          rightchild = maxindex
          maxindex = tmp
          //  swap(leftchild, minindex)
        }
        if (maxindex != index) {
            let tp = list[maxindex]
            list[maxindex] = list[index]
            list[index] = tp
            heapfly(list, length, maxindex)
        }
    }

   let build_heap = function (list:number[], lenght:number){
        var lastperent = Math.floor((length-1-1) / 2);
        for (var i = lastperent; i >= 0; i--) {
            heapfly(list, length, i);
        }
    }

    var list: number[] = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19];
    console.log(list)
    var length: number = list.length;
    build_heap(list, length)

    for (var i = length-1; i >= 0; i--) {
        let temp = list[i]
        list[i] = list[0]
        list[0] = temp
        heapfly(list, i, 0)
    }

    console.log(list)

#+end_src
swap in function
#+begin_src typescript :exports both :results both
  let swap = function (left:number, right:number){
    return [right, left]
    }

  let heapfly =  function(list:number[], length:number, index:number){
        var leftchild = index*2+1
        var rightchild = index*2+2
        var maxindex = index
        if (leftchild < length && list[leftchild] >list[maxindex]) {
            [leftchild, maxindex] = swap(leftchild, maxindex)
        }

      if (rightchild < length && list[rightchild]>list[maxindex]) {
          [rightchild, maxindex] = swap(rightchild, maxindex)
        }
        if (maxindex != index) {
            [list[maxindex], list[index]] = swap(list[maxindex], list[index])
            heapfly(list, length, maxindex)
        }
    }
   let build_heap = function (list:number[], lenght:number){
        var lastperent = Math.floor((length-1-1) / 2);
        for (var i = lastperent; i >= 0; i--) {
            heapfly(list, length, i);
        }
    }
    var list: number[] = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19];
    console.log(list)
    var length: number = list.length;
    build_heap(list, length)

    for (var i = length-1; i >= 0; i--) {
        [list[i], list[0]]= swap(list[i], list[0])
        heapfly(list, i, 0)
    }
    console.log(list)

#+End_src

#+RESULTS:
#+begin_example
[
    2,  1,     3,  4,   5,
    3,  5,     7,  8,  45,
    9, 25,    34, 23, 345,
  546, 20, 23465, 90,  19
]
[
   1,  2,   3,   3,     4,
   5,  5,   7,   8,     9,
  19, 20,  23,  25,    34,
  45, 90, 345, 546, 23465
]
#+end_example

* Shell Sort
** Algorithm
#+begin_src 
A[a] for a -> 0, 1, 2....l-1
for G[g] for g -> 0, 1, ...m
for j -> 0, 1, 2...m-1:
  d = G[j]
  for i -> d, 2d, 3d   
    value <- A[i]
    index <- i
    while(A[index-d] > value && index > 0)
        A[index] = A[index-d]
        index -= d        
    A[index] <- value
#+end_src
** Python
#+begin_src ipython :results output :exports both
  def shellsort(list1, N):
      G = [7, 5, 3, 1]
      for d in G:
          i = d
          while i < N:
              value = list1[i]
              index = i
              while index > 0 and list1[index-d] > value:
                  list1[index] = list1[index-d]
                  index -= d
              i += d
              list1[index] = value

  list1 = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19, 900]
  langdu = len(list1)
  shellsort(list1, langdu)
  print(list1)
#+end_src

#+RESULTS:
: [1, 2, 3, 3, 4, 5, 5, 7, 8, 9, 19, 20, 23, 25, 34, 45, 90, 345, 546, 900, 23465]

** Java
#+begin_src java :classname ShellSorting :results output :exports both
  class ShellSorting
  {
      public static void main(String[] args)
      {
          int a [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
          int langdu = a.length;
          shellsort(a, langdu);
          for (int i = 0; i < langdu; i++) {
              System.out.printf("%d ", a[i]);
          }
      }
      private static void shellsort(int []A, int N){
          int Grap [] = {7, 5, 3, 1};
          for (int i = 0; i < Grap.length; i++) {
              int d = Grap[i];
              for (int j = d; j < N; j+=d) {
                  int value = A[j];
                  int index = j;
                  while(index > 0 && A[index-d] > value){
                      A[index] = A[index-d];
                      index -= d;
                  }
                  A[index] = value;
              }
          }
      }
  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 

