Algorithm.html
<div id="outline-container-org36b6f45" class="outline-3">
<h3 id="org36b6f45">Typescript</h3>
<div class="outline-text-3" id="text-org36b6f45">
<p>
swap in-place
</p>
<div class="org-src-container">
<pre class="src src-typescript">// let swap = function (left:number, right:number){
//       var temp = left
//       left = right
//       right = temp
//   }

let heapfly =  function(list:number[], length:number, index:number){
      var leftchild = index*2+1
      var rightchild = index*2+2
      var maxindex = index
      if (leftchild &lt; length &amp;&amp; list[leftchild] &gt;list[maxindex]) {
	  let temp = leftchild
	  leftchild = maxindex
	  maxindex = temp
//          swap(leftchild, minindex)
      }

    if (rightchild &lt; length &amp;&amp; list[rightchild]&gt;list[maxindex]) {
	let tmp = rightchild
	rightchild = maxindex
	maxindex = tmp
	//  swap(leftchild, minindex)
      }
      if (maxindex != index) {
	  let tp = list[maxindex]
	  list[maxindex] = list[index]
	  list[index] = tp
	  heapfly(list, length, maxindex)
      }
  }

 let build_heap = function (list:number[], lenght:number){
      var lastperent = Math.floor((length-1-1) / 2);
      for (var i = lastperent; i &gt;= 0; i--) {
	  heapfly(list, length, i);
      }
  }

  var list: number[] = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19];
  console.log(list)
  var length: number = list.length;
  build_heap(list, length)

  for (var i = length-1; i &gt;= 0; i--) {
      let temp = list[i]
      list[i] = list[0]
      list[0] = temp
      heapfly(list, i, 0)
  }

  console.log(list)

</pre>
</div>
<p>
swap in function
</p>
<div class="org-src-container">
<pre class="src src-typescript">let swap = function (left:number, right:number){
  return [right, left]
  }

let heapfly =  function(list:number[], length:number, index:number){
      var leftchild = index*2+1
      var rightchild = index*2+2
      var maxindex = index
      if (leftchild &lt; length &amp;&amp; list[leftchild] &gt;list[maxindex]) {
	  [leftchild, maxindex] = swap(leftchild, maxindex)
      }

    if (rightchild &lt; length &amp;&amp; list[rightchild]&gt;list[maxindex]) {
	[rightchild, maxindex] = swap(rightchild, maxindex)
      }
      if (maxindex != index) {
	  [list[maxindex], list[index]] = swap(list[maxindex], list[index])
	  heapfly(list, length, maxindex)
      }
  }
 let build_heap = function (list:number[], lenght:number){
      var lastperent = Math.floor((length-1-1) / 2);
      for (var i = lastperent; i &gt;= 0; i--) {
	  heapfly(list, length, i);
      }
  }
  var list: number[] = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19];
  console.log(list)
  var length: number = list.length;
  build_heap(list, length)

  for (var i = length-1; i &gt;= 0; i--) {
      [list[i], list[0]]= swap(list[i], list[0])
      heapfly(list, i, 0)
  }
  console.log(list)

</pre>
</div>

<pre class="example">
[
    2,  1,     3,  4,   5,
    3,  5,     7,  8,  45,
    9, 25,    34, 23, 345,
  546, 20, 23465, 90,  19
]
[
   1,  2,   3,   3,     4,
   5,  5,   7,   8,     9,
  19, 20,  23,  25,    34,
  45, 90, 345, 546, 23465
]
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c4643e" class="outline-2">
<h2 id="org2c4643e">Shell Sort</h2>
<div class="outline-text-2" id="text-org2c4643e">
</div>
<div id="outline-container-orgeab49c8" class="outline-3">
<h3 id="orgeab49c8">Algorithm</h3>
<div class="outline-text-3" id="text-orgeab49c8">
<pre class="example">
A[a] for a -&gt; 0, 1, 2....l-1
for G[g] for g -&gt; 0, 1, ...m
for j -&gt; 0, 1, 2...m-1:
  d = G[j]
  for i -&gt; d, 2d, 3d   
    value &lt;- A[i]
    index &lt;- i
    while(A[index-d] &gt; value &amp;&amp; index &gt; 0)
	A[index] = A[index-d]
	index -= d        
    A[index] &lt;- value
</pre>
</div>
</div>
<div id="outline-container-orge71d51d" class="outline-3">
<h3 id="orge71d51d">Python</h3>
<div class="outline-text-3" id="text-orge71d51d">
<div class="org-src-container">
<pre class="src src-ipython">def shellsort(list1, N):
    G = [7, 5, 3, 1]
    for d in G:
	i = d
	while i &lt; N:
	    value = list1[i]
	    index = i
	    while index &gt; 0 and list1[index-d] &gt; value:
		list1[index] = list1[index-d]
		index -= d
	    i += d
	    list1[index] = value

list1 = [2, 1, 3, 4, 5, 3, 5, 7, 8, 45,  9, 25, 34, 23, 345, 546, 20, 23465, 90, 19, 900]
langdu = len(list1)
shellsort(list1, langdu)
print(list1)
</pre>
</div>

<pre class="example">
[1, 2, 3, 3, 4, 5, 5, 7, 8, 9, 19, 20, 23, 25, 34, 45, 90, 345, 546, 900, 23465]

</pre>
</div>
</div>

<div id="outline-container-org0d5681e" class="outline-3">
<h3 id="org0d5681e">Java</h3>
<div class="outline-text-3" id="text-org0d5681e">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ShellSorting</span>
{
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>)
    {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> [] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19};
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = a.length;
        shellsort(a, langdu);
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; <span style="font-weight: bold; text-decoration: underline;">langdu</span>; i++) {
            System.out.printf(<span style="font-style: italic;">"%d "</span>, a[i]);
        }
    }
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">shellsort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> []<span style="font-weight: bold; font-style: italic;">A</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span>){
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">Grap</span> [] = {7, 5, 3, 1};
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; Grap.<span style="font-weight: bold; text-decoration: underline;">length</span>; i++) {
            <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">d</span> = Grap[i];
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = d; j &lt; <span style="font-weight: bold; text-decoration: underline;">N</span>; j+=d) {
                <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span> = A[j];
                <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = j;
                <span style="font-weight: bold;">while</span>(index &gt; 0 &amp;&amp; A[index-d] &gt; value){
                    A[index] = A[index-d];
                    index -= d;
                }
                A[index] = value;
            }
        }
    }
}

</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 34 45 90 345 546 23465 

</pre>
</div>
</div>
