Algorithm.org
** C/C++
#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19, 23, 45,78};
    int langdu = sizeof(A)/sizeof(int);
    shellsort(A, langdu);
    for (int i = 0; i < langdu; ++i) {
      printf("%d ",A[i] );
    }
    return 0;
  }
  void shellsort(int A[], int langdu){
    int grap[] ={7, 5, 3, 1};
    int N = sizeof(grap) / sizeof(int);
    for (int j = 0; j < N; ++j) {
      int d = grap[j];
      for (int i = d; i < langdu; i=i+d) {
        int value = A[i];
        int index = i;
        while (index > 0 && A[index-d] > value) {
          A[index] = A[index-d];
          index -= d;
        }
        A[index] = value;
      }
    }
    return;
  }

#+end_src

#+RESULTS:
: 1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 23 34 45 45 78 90 345 546 23465

* Redix
** Description
#+begin_src 
N numbers are waiting to be sorted,
each number has maxmum d digit,
and each digit is from 0 to k
#+end_src

** Algorithmu
#+begin_src 
Least significant digital OR Most significant digital

LSD: from right to left, only sort all numbers according to the last digit(better with conut sort)
and then move  to left on the second digit, do it again
Time complexity  $\Theta (d(n+k))$
#+end_src

* Bucket Sort
** Algorithm
#+begin_src 
all data are uniformly distributed in a range
spilt the range into n equal-sized intervals
independently chosen data and put them into corresponding interval
sort each interval(better with insert sort)
output by list in order of all buckets
#+end_src

* Count Sort
** Algorithm
#+begin_src 
A[n] for n from 1 to N will be sorted
using additional array C[k]
where k from min(A) to max(A)
output B[n] for n from 1 to N
#+end_src

#+begin_src
for i from 1 to n: C[i] <- 0
for n from 1 to N: C[A[n]]++
for i from 2 to n: C[i] = C[i]+C[i-1]
for n from N to 1: B[C[A[n]]] = A[n], C[A[n]]--
#+end_src

** Python
#+begin_src ipython :results output :exports both
  A = [1,4,2,5,3,6,2,5,3,6,3,4,7,8,4]
  print(A)
  lengthA = len(A)
  minA = min(A)
  maxA = max(A)
  lengthC = maxA-minA+1

  C = [0]*lengthC

  for n in range(lengthA):
    C[A[n]-1] = C[A[n]-1]+1
  print(C)

  for i in range(1, lengthC,1):
    C[i] = C[i]+C[i-1]
  print(C)

  B = [0]*lengthA
  for n in range(lengthA-1,-1,-1):
    B[C[A[n]-1]-1] = A[n]
    C[A[n]-1] = C[A[n]-1]-1

  print(B)


#+end_src

#+RESULTS:
: [1, 4, 2, 5, 3, 6, 2, 5, 3, 6, 3, 4, 7, 8, 4]
: [1, 2, 3, 3, 2, 2, 1, 1]
: [1, 3, 6, 9, 11, 13, 14, 15]
: [1, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 6, 6, 7, 8]
* Dichotomy
