Algorithm.html

<div id="outline-container-orgcec4f1c" class="outline-3">
<h3 id="orgcec4f1c">C/C++</h3>
<div class="outline-text-3" id="text-orgcec4f1c">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19, 23, 45,78};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span> = <span style="font-weight: bold;">sizeof</span>(A)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  shellsort(A, langdu);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; langdu; ++i) {
    printf(<span style="font-style: italic;">"%d "</span>,A[i] );
  }
  <span style="font-weight: bold;">return</span> 0;
}
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">shellsort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">langdu</span>){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">grap</span>[] ={7, 5, 3, 1};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">sizeof</span>(grap) / <span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 0; j &lt; N; ++j) {
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">d</span> = grap[j];
    <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = d; i &lt; langdu; i=i+d) {
      <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span> = A[i];
      <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">index</span> = i;
      <span style="font-weight: bold;">while</span> (index &gt; 0 &amp;&amp; A[index-d] &gt; value) {
        A[index] = A[index-d];
        index -= d;
      }
      A[index] = value;
    }
  }
  <span style="font-weight: bold;">return</span>;
}

</pre>
</div>

<pre class="example">
1 2 3 3 4 4 5 6 7 8 9 9 19 20 23 23 34 45 45 78 90 345 546 23465

</pre>
</div>
</div>
</div>

<div id="outline-container-org9054861" class="outline-2">
<h2 id="org9054861">Redix</h2>
<div class="outline-text-2" id="text-org9054861">
</div>
<div id="outline-container-org42fc4ac" class="outline-3">
<h3 id="org42fc4ac">Description</h3>
<div class="outline-text-3" id="text-org42fc4ac">
<pre class="example">
N numbers are waiting to be sorted,
each number has maxmum d digit,
and each digit is from 0 to k
</pre>
</div>
</div>

<div id="outline-container-org1574d7c" class="outline-3">
<h3 id="org1574d7c">Algorithmu</h3>
<div class="outline-text-3" id="text-org1574d7c">
<pre class="example">
Least significant digital OR Most significant digital

LSD: from right to left, only sort all numbers according to the last digit(better with conut sort)
and then move  to left on the second digit, do it again
Time complexity  $\Theta (d(n+k))$
</pre>
</div>
</div>
</div>

<div id="outline-container-org552d071" class="outline-2">
<h2 id="org552d071">Bucket Sort</h2>
<div class="outline-text-2" id="text-org552d071">
</div>
<div id="outline-container-org47988e6" class="outline-3">
<h3 id="org47988e6">Algorithm</h3>
<div class="outline-text-3" id="text-org47988e6">
<pre class="example">
all data are uniformly distributed in a range
spilt the range into n equal-sized intervals
independently chosen data and put them into corresponding interval
sort each interval(better with insert sort)
output by list in order of all buckets
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb9a6dc" class="outline-2">
<h2 id="orgfb9a6dc">Count Sort</h2>
<div class="outline-text-2" id="text-orgfb9a6dc">
</div>
<div id="outline-container-org42d6a8a" class="outline-3">
<h3 id="org42d6a8a">Algorithm</h3>
<div class="outline-text-3" id="text-org42d6a8a">
<pre class="example">
A[n] for n from 1 to N will be sorted
using additional array C[k]
where k from min(A) to max(A)
output B[n] for n from 1 to N
</pre>

<pre class="example">
for i from 1 to n: C[i] &lt;- 0
for n from 1 to N: C[A[n]]++
for i from 2 to n: C[i] = C[i]+C[i-1]
for n from N to 1: B[C[A[n]]] = A[n], C[A[n]]--
</pre>
</div>
</div>

<div id="outline-container-orga0bc336" class="outline-3">
<h3 id="orga0bc336">Python</h3>
<div class="outline-text-3" id="text-orga0bc336">
<div class="org-src-container">
<pre class="src src-ipython">A = [1,4,2,5,3,6,2,5,3,6,3,4,7,8,4]
print(A)
lengthA = len(A)
minA = min(A)
maxA = max(A)
lengthC = maxA-minA+1

C = [0]*lengthC

for n in range(lengthA):
  C[A[n]-1] = C[A[n]-1]+1
print(C)

for i in range(1, lengthC,1):
  C[i] = C[i]+C[i-1]
print(C)

B = [0]*lengthA
for n in range(lengthA-1,-1,-1):
  B[C[A[n]-1]-1] = A[n]
  C[A[n]-1] = C[A[n]-1]-1

print(B)


</pre>
</div>

<pre class="example">
[1, 4, 2, 5, 3, 6, 2, 5, 3, 6, 3, 4, 7, 8, 4]
[1, 2, 3, 3, 2, 2, 1, 1]
[1, 3, 6, 9, 11, 13, 14, 15]
[1, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 6, 6, 7, 8]

</pre>
</div>
</div>
</div>
