Algorithm.html
<div id="outline-container-orge65a1dd" class="outline-2">
<h2 id="orge65a1dd">Dichotomy</h2>
<div class="outline-text-2" id="text-orge65a1dd">
</div>
<div id="outline-container-org019dc5c" class="outline-3">
<h3 id="org019dc5c">C/C++</h3>
<div class="outline-text-3" id="text-org019dc5c">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">dichotomy</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> **<span style="font-weight: bold; font-style: italic;">p</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">start</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">end</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>){
  <span style="font-weight: bold;">if</span> (*p == <span style="font-weight: bold; text-decoration: underline;">NULL</span>) {
    printf(<span style="font-style: italic;">" This array is empty !\n"</span>);
    <span style="font-weight: bold;">return</span> -1;
  }
  <span style="font-weight: bold;">if</span> (x &lt; *start || x &gt; *end) {
    printf(<span style="font-style: italic;">"this element is not in the array\n"</span>);
    <span style="font-weight: bold;">return</span> -1;
  }
  <span style="font-weight: bold;">if</span> (x == *start || x == *end) {
    <span style="font-weight: bold;">return</span> x;
  }
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">len</span> = 0;
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">temp</span> = *p; *temp != *end; temp++) {
    len++;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">mid</span> = *(*p+len/2);
  <span style="font-weight: bold;">if</span> (mid == *start || x == *end) {
    <span style="font-weight: bold;">return</span> -1;
  }

  <span style="font-weight: bold;">if</span> (mid &gt;= x) {
    <span style="font-weight: bold;">return</span> dichotomy(p, start, &amp;mid, x);
  }<span style="font-weight: bold;">else</span> {
    <span style="font-weight: bold; text-decoration: underline;">int</span> * <span style="font-weight: bold; font-style: italic;">newp</span> = *p+len/2;
    <span style="font-weight: bold;">return</span> dichotomy(&amp;newp, &amp;mid, end, x);
  }
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">array</span>[] = {1,3,7,12,45,78,234,678,5678};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 690;
  <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = array;
  <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">start</span> = array;
  <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">end1</span> = &amp;array[8];
  <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">end</span> = (<span style="font-weight: bold; text-decoration: underline;">int</span> *)(&amp;array+1);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> = dichotomy(&amp;p, start, (end-1), x);
  <span style="font-weight: bold;">if</span> (a == x) {
      printf(<span style="font-style: italic;">"the element is found !\n"</span>);
  }<span style="font-weight: bold;">else</span> {
      printf(<span style="font-style: italic;">"the element is not found !\n"</span>);
  }
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>

<p>
Using (int *)(&amp;list+1)-1 to find the last elemenet of list[]
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">isinarray</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> **<span style="font-weight: bold; font-style: italic;">p</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">start</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">end</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>){
  <span style="font-weight: bold;">if</span> (*p == <span style="font-weight: bold; text-decoration: underline;">NULL</span>) {
    <span style="font-weight: bold;">return</span> 0;
  }
  <span style="font-weight: bold;">if</span> (x &lt; *start || x &gt; *end) {
    <span style="font-weight: bold;">return</span> 0;
  }

  <span style="font-weight: bold;">if</span> (x == *start || x == *end) {
    <span style="font-weight: bold;">return</span> 1;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0;
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">temp</span> = *p; *temp != *end; temp++) {
    i++;
  }
  <span style="font-weight: bold;">if</span> (i == 1 &amp;&amp; (x != *start || x != *end)) {
    <span style="font-weight: bold;">return</span> 0;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">medium</span> = *(*p+i/2);
  <span style="font-weight: bold;">if</span> (medium &gt;= x) {
    <span style="font-weight: bold;">return</span> isinarray(p, start, &amp;medium, x);
  }<span style="font-weight: bold;">else</span> {
    <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">m</span> = *p+i/2;
    <span style="font-weight: bold;">return</span> isinarray(&amp;m, &amp;medium, end , x);
  }
}


<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">list</span> [] = {1,3,6,9,12,34,56,78,90,123,456,789};
  <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = list;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 39;
  <span style="font-weight: bold;">if</span> (isinarray(&amp;p, list, (<span style="font-weight: bold; text-decoration: underline;">int</span> *)(&amp;list+1)-1, x)) {
    printf(<span style="font-style: italic;">"IN"</span>);
  }<span style="font-weight: bold;">else</span> {
    printf(<span style="font-style: italic;">"NOT IN"</span>);
  }
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
NOT IN

</pre>
</div>
</div>
</div>
