Algorithm.html

<div id="outline-container-orgc24e7a2" class="outline-2">
<h2 id="orgc24e7a2">HoffmannCode</h2>
<div class="outline-text-2" id="text-orgc24e7a2">
</div>
<div id="outline-container-org0989a78" class="outline-3">
<h3 id="org0989a78">C/C++</h3>
<div class="outline-text-3" id="text-org0989a78">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>
<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold;">struct</span> {
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">data</span>;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">parent</span>, <span style="font-weight: bold; font-style: italic;">lboy</span>, <span style="font-weight: bold; font-style: italic;">rboy</span>;
}<span style="font-weight: bold; text-decoration: underline;">HTNode</span>, *<span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span>;
<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold; text-decoration: underline;">char</span> ** <span style="font-weight: bold; text-decoration: underline;">HoffmanCode</span>;
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">Select</span>(<span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span> <span style="font-weight: bold; font-style: italic;">HT</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">s1</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">s2</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">end</span>){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">min1</span>, <span style="font-weight: bold; font-style: italic;">min2</span>;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1;
  <span style="font-weight: bold;">while</span> (HT[i].parent != 0 &amp;&amp; i &lt;= end) {
    i++;
  }
  min1 =  HT[i].data;
  *s1 = i;
  i++;
  <span style="font-weight: bold;">while</span> (HT[i].parent != 0 &amp;&amp; i &lt;= end) {
    i++;
  }
  <span style="font-weight: bold;">if</span> (HT[i].data &lt;= min1) {
    min2 = min1;
    *s2 = *s1;
    min1 = HT[i].data;
    *s1 = i;
  }<span style="font-weight: bold;">else</span> {
    min2 = HT[i].data;
    *s2 = i;
  }
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = i+1; j &lt;= end; j++) {
    <span style="font-weight: bold;">if</span> (HT[j].parent != 0) {
      <span style="font-weight: bold;">continue</span>;
    }
    <span style="font-weight: bold;">if</span> (HT[j].data &lt;= min1) {
      min2 = min1;
      *s2 = *s1;
      min1 = HT[j].data;
      *s1 = j;
    }<span style="font-weight: bold;">else</span> {
      min1 = HT[j].data;
      *s2 = j;
    }
  }
}


<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">CreateHoffman</span>(<span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span> *<span style="font-weight: bold; font-style: italic;">HT</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">list</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">length</span>){
  <span style="font-weight: bold;">if</span> (length &lt;= 1) {
    <span style="font-weight: bold;">return</span>;
  }
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">m</span> = 2*length-1;
  *HT = (<span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span>)malloc(<span style="font-weight: bold;">sizeof</span>(HTNode) * m);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>;
  <span style="font-weight: bold;">for</span> (i = 1; i &lt;= length; i++) {
    (*HT+i)-&gt;data = *(list+i-1);
    (*HT+i)-&gt;parent = 0;
    (*HT+i)-&gt;lboy = 0;
    (*HT+i)-&gt;rboy = 0;
  }
  <span style="font-weight: bold;">for</span> (i = length+1; i &lt;= m; i++) {
    (*HT+i)-&gt;data = 0;
    (*HT+i)-&gt;parent = 0;
    (*HT+i)-&gt;lboy = 0;
    (*HT+i)-&gt;rboy = 0;
  }

  <span style="font-weight: bold;">for</span> (i = length+1; i &lt;=m; i++) {
      <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">s1</span>, <span style="font-weight: bold; font-style: italic;">s2</span>;
      Select(*HT, &amp;s1, &amp;s2, i-1);
      (*HT)[s1].parent = (*HT)[s2].parent = i;
      (*HT)[i].lboy = s1;
      (*HT)[i].rboy = s2;
      (*HT)[i].data = (*HT)[s1].data + (*HT)[s2].data;
  }
}

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">CreateHoffmanCode</span>(<span style="font-weight: bold; text-decoration: underline;">HoffmanCode</span> *<span style="font-weight: bold; font-style: italic;">hcode</span>, <span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span> <span style="font-weight: bold; font-style: italic;">HT</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">length</span>){
  *hcode = (<span style="font-weight: bold; text-decoration: underline;">HoffmanCode</span>)malloc(<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> * ) * length+1);
  <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">cd</span> = (<span style="font-weight: bold; text-decoration: underline;">char</span> *)malloc(<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">char</span>) * length);
  cd[length-1] = <span style="font-style: italic;">'\n'</span>;
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>  = 1; i &lt;= length; i++) {
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">start</span> = length -1;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">c</span> = i;
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = HT[c].parent;
    <span style="font-weight: bold;">while</span> (j != 0) {
      <span style="font-weight: bold;">if</span> (HT[j].lboy == c) {
        cd[--start] = <span style="font-style: italic;">'1'</span>;
      }
      <span style="font-weight: bold;">else</span> {
        cd[--start] = <span style="font-style: italic;">'0'</span>;
      }
      c = j;
      j = HT[j].parent;
    }
    (*hcode)[i] = (<span style="font-weight: bold; text-decoration: underline;">char</span> *)malloc(<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> )*length-start);
    strcpy((*hcode)[i], &amp;cd[start]);
  }
  free(cd);
}
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">showHoffmanCode</span>(<span style="font-weight: bold; text-decoration: underline;">HoffmanCode</span> <span style="font-weight: bold; font-style: italic;">hcode</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">list</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">length</span>){
  printf(<span style="font-style: italic;">"Here we go\n"</span>);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt;= length; i++) {
    printf(<span style="font-style: italic;">"%d : is %s\n"</span>,list[i-1], hcode[i]);
  }
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">HoffmanTree</span> <span style="font-weight: bold; font-style: italic;">htree</span>;
  <span style="font-weight: bold; text-decoration: underline;">HoffmanCode</span> <span style="font-weight: bold; font-style: italic;">hcode</span>;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">list</span>[] = {1,18,2,56,3,4, 44,5,7,34,78,90,234,789};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">length</span> = <span style="font-weight: bold;">sizeof</span>(list)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  CreateHoffman(&amp;htree, list, length);
  CreateHoffmanCode(&amp;hcode, htree, length);
  showHoffmanCode(hcode, list, length);
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>

<pre class="example">
Here we go
1 : is 0000001

18 : is 00001

2 : is 000001

56 : is 0001

3 : is 0000000001

4 : is 000000001

44 : is 00000001

5 : is 0000000000001

7 : is 000000000001

34 : is 00000000001

78 : is 001

90 : is 01

234 : is 0

789 : is 0000000000000
</pre>
</div>
</div>
</div>
