Algorithm.html

<div id="outline-container-org3cc27aa" class="outline-2">
<h2 id="org3cc27aa">JosephusRing</h2>
<div class="outline-text-2" id="text-org3cc27aa">
</div>
<div id="outline-container-orgc6c99b1" class="outline-3">
<h3 id="orgc6c99b1">C/C++</h3>
<div class="outline-text-3" id="text-orgc6c99b1">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>
<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">node</span>{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">number</span>;
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">node</span> * <span style="font-weight: bold; font-style: italic;">next</span>;
}<span style="font-weight: bold; text-decoration: underline;">person</span>;
<span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold;">initLink</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>){
  <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">head</span>=(<span style="font-weight: bold; text-decoration: underline;">person</span>*)malloc(<span style="font-weight: bold;">sizeof</span>(person));
  head-&gt;number=1;
  head-&gt;next=<span style="font-weight: bold; text-decoration: underline;">NULL</span>;
  <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">cyclic</span>=head;
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>=2; i&lt;=n; i++) {
    <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">body</span>=(<span style="font-weight: bold; text-decoration: underline;">person</span>*)malloc(<span style="font-weight: bold;">sizeof</span>(person));
    body-&gt;number=i;
    body-&gt;next=<span style="font-weight: bold; text-decoration: underline;">NULL</span>; 
    cyclic-&gt;next=body;
    cyclic=cyclic-&gt;next;
  }
  cyclic-&gt;next=head;<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#39318;&#23614;&#30456;&#36830;</span>
  <span style="font-weight: bold;">return</span> head;
}

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">findAndKillK</span>(<span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">head</span>,<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span>,<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">m</span>){

  <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">tail</span>=head;
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25214;&#21040;&#38142;&#34920;&#31532;&#19968;&#20010;&#32467;&#28857;&#30340;&#19978;&#19968;&#20010;&#32467;&#28857;&#65292;&#20026;&#21024;&#38500;&#25805;&#20316;&#20570;&#20934;&#22791;</span>
  <span style="font-weight: bold;">while</span> (tail-&gt;next!=head) {
    tail=tail-&gt;next;
  }
  <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">p</span>=head;
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25214;&#21040;&#32534;&#21495;&#20026;k&#30340;&#20154;</span>
  <span style="font-weight: bold;">while</span> (p-&gt;number!=k) {
    tail=p;
    p=p-&gt;next;
  }
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#20174;&#32534;&#21495;&#20026;k&#30340;&#20154;&#24320;&#22987;&#65292;&#21482;&#26377;&#31526;&#21512;p-&gt;next==p&#26102;&#65292;&#35828;&#26126;&#38142;&#34920;&#20013;&#38500;&#20102;p&#32467;&#28857;&#65292;&#25152;&#26377;&#32534;&#21495;&#37117;&#20986;&#21015;&#20102;&#65292;</span>
  <span style="font-weight: bold;">while</span> (p-&gt;next!=p) {
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25214;&#21040;&#20174;p&#25253;&#25968;1&#24320;&#22987;&#65292;&#25253;m&#30340;&#20154;&#65292;&#24182;&#19988;&#36824;&#35201;&#30693;&#36947;&#25968;m-1de&#20154;&#30340;&#20301;&#32622;tail&#65292;&#26041;&#20415;&#20570;&#21024;&#38500;&#25805;&#20316;&#12290;</span>
    <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>=1; i&lt;m; i++) {
      tail=p;
      p=p-&gt;next;
    }
    tail-&gt;next=p-&gt;next;<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#20174;&#38142;&#34920;&#19978;&#23558;p&#32467;&#28857;&#25688;&#19979;&#26469;</span>
    printf(<span style="font-style: italic;">"&#20986;&#21015;&#20154;&#30340;&#32534;&#21495;&#20026;:%d\n"</span>,p-&gt;number);
    free(p);
    p=tail-&gt;next;<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#32487;&#32493;&#20351;&#29992;p&#25351;&#38024;&#25351;&#21521;&#20986;&#21015;&#32534;&#21495;&#30340;&#19979;&#19968;&#20010;&#32534;&#21495;&#65292;&#28216;&#25103;&#32487;&#32493;</span>
  }
  printf(<span style="font-style: italic;">"&#20986;&#21015;&#20154;&#30340;&#32534;&#21495;&#20026;:%d\n"</span>,p-&gt;number);
  free(p);
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {
  printf(<span style="font-style: italic;">"&#36755;&#20837;&#22278;&#26700;&#19978;&#30340;&#20154;&#25968;n:"</span>);
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">int n; */</span>
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">scanf("%d",&amp;n); */</span>
  <span style="font-weight: bold; text-decoration: underline;">person</span> * <span style="font-weight: bold; font-style: italic;">head</span>=initLink(n);
  printf(<span style="font-style: italic;">"&#20174;&#31532;k&#20154;&#24320;&#22987;&#25253;&#25968;(k&gt;1&#19988;k&lt;%d)&#65306;"</span>,n);
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">int k; */</span>
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">scanf("%d",&amp;k); */</span>
  printf(<span style="font-style: italic;">"&#25968;&#21040;m&#30340;&#20154;&#20986;&#21015;&#65306;"</span>);
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">int m; */</span>
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">scanf("%d",&amp;m); */</span>
  findAndKillK(head, k, m);
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>

<pre class="example">
输入圆桌上的人数n:从第k人开始报数(k&gt;1且k&lt;20)：数到m的人出列：出列人的编号为:5
出列人的编号为:10
出列人的编号为:15
出列人的编号为:20
出列人的编号为:6
出列人的编号为:12
出列人的编号为:18
出列人的编号为:4
出列人的编号为:13
出列人的编号为:1
出列人的编号为:9
出列人的编号为:19
出列人的编号为:11
出列人的编号为:3
出列人的编号为:17
出列人的编号为:16
出列人的编号为:2
出列人的编号为:8
出列人的编号为:14
出列人的编号为:7
</pre>
</div>
</div>
</div>
