Algorithm.html

<div id="outline-container-orgc946ec7" class="outline-2">
<h2 id="orgc946ec7">KMPmachting</h2>
<div class="outline-text-2" id="text-orgc946ec7">
</div>
<div id="outline-container-org1ddb97b" class="outline-3">
<h3 id="org1ddb97b">C/C++</h3>
<div class="outline-text-3" id="text-org1ddb97b">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">genertarray</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">pattern</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">prefix</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>){
  prefix[0] = 0;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">len</span> = 0;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> =1;
  <span style="font-weight: bold;">while</span> (i &lt; n) {
    <span style="font-weight: bold;">if</span> (pattern[i] == pattern[len]) {
      len++;
      prefix[i] = len;
      i++;
    }<span style="font-weight: bold;">else</span> {
      <span style="font-weight: bold;">if</span> (len &gt; 0) {
        len = prefix[len-1];   <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">go the preious len, and matching again</span>
      }<span style="font-weight: bold;">else</span> {
        prefix[i] = len;        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">in case len &lt;= 0, bzw, the first and second is not matching</span>
        i++;
      }
    }
  }
}

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">move_array</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">prefix</span> [], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span>){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>;
  <span style="font-weight: bold;">for</span> ( i = n-1; i &gt; 0; i--) {
    prefix[i] = prefix[i-1];
  }
  prefix[0] = -1;
}

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">kmp_search</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">text</span>[], <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">pattern</span>[]){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">k</span> = strlen(pattern);
  <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">prefix</span> =(<span style="font-weight: bold; text-decoration: underline;">int</span> *) (malloc(<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> )* k));
  genertarray(pattern, prefix, k);
  move_array(prefix, k);

  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">text    index i, max n</span>
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">pattern index j, max m</span>

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 0;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">n</span> = strlen(text);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">m</span> = strlen(pattern);
  <span style="font-weight: bold;">while</span> (i &lt; n) {
    <span style="font-weight: bold;">if</span> (j == m-1 &amp;&amp; text[i] == pattern[j]) { <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">if found</span>
      printf(<span style="font-style: italic;">"Fonund at %d \n"</span>, i-j);
      j = prefix[j];                         <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">still go forward</span>
    }
    <span style="font-weight: bold;">if</span> (text[i] == pattern[j]) {            
      i++;j++;
    }<span style="font-weight: bold;">else</span> {
      j = prefix[j];                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">if not matching</span>
      <span style="font-weight: bold;">if</span> (j == -1) {                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">if the first is not matching</span>
        i++;j++;
      }
    }
  }
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">pattern</span>[] = <span style="font-style: italic;">"ABABBBA"</span>; 
  <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">text</span>[]    = <span style="font-style: italic;">"JUHkSABABBBABABA"</span>;
  kmp_search(text, pattern);
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
Fonund at 5

</pre>
</div>
</div>

<div id="outline-container-org275f400" class="outline-3">
<h3 id="org275f400">C/C++</h3>
<div class="outline-text-3" id="text-org275f400">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdlib.h&gt;</span>

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">sort only the pure given numbers, and change each time the sort direction</span>
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">recSort</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">start</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">end</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">reverse</span>){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">count</span> = 0;

  <span style="font-weight: bold;">if</span> (start == <span style="font-weight: bold; text-decoration: underline;">NULL</span> || end == <span style="font-weight: bold; text-decoration: underline;">NULL</span>) {
    <span style="font-weight: bold;">return</span> 0;
  }

  <span style="font-weight: bold;">if</span> (start == end || start +1 == end) {
    <span style="font-weight: bold;">return</span> 0;
  }


  <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">p</span>;
  <span style="font-weight: bold;">if</span> (reverse) 
    p = end -1;
  <span style="font-weight: bold;">else</span>
    p = start+1;


  <span style="font-weight: bold;">while</span> (p &lt; end &amp;&amp; p &gt; start ) {
    <span style="font-weight: bold;">if</span> (*(p-1) &lt; *p) {
      <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">temp</span> = *(p-1);
      *(p-1) = *p;
      *p = temp;
      count++;
    }

    <span style="font-weight: bold;">if</span> (reverse)
      p--;
    <span style="font-weight: bold;">else</span>
      p++;
  }

  <span style="font-weight: bold;">if</span> (reverse)
    <span style="font-weight: bold;">return</span> count +  recSort(start+1, end, 0);
  <span style="font-weight: bold;">else</span>
    <span style="font-weight: bold;">return</span> count +  recSort(start, end-1, 1);

}


<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[]) {

  <span style="font-weight: bold;">if</span> (argc &lt; 1) {
    recSort(<span style="font-weight: bold; text-decoration: underline;">NULL</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, 0);
    <span style="font-weight: bold;">return</span> -2;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span>* <span style="font-weight: bold; font-style: italic;">f</span> = malloc(<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>) * (argc-1));
  <span style="font-weight: bold;">if</span> (f == <span style="font-weight: bold; text-decoration: underline;">NULL</span>) {
    <span style="font-weight: bold;">return</span> -3;
  }

  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt; argc; i++) {
    f[i-1] =atoi(argv[i]);
  }

  printf(<span style="font-style: italic;">"before the sort \n"</span>);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> =1 ; i &lt; argc; i++) {
    printf(<span style="font-style: italic;">"%d\n"</span>,f[i-1]);
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>=  recSort(f, &amp;f[argc-1] , 0);
  printf(<span style="font-style: italic;">"alles in allem, %d times change  \n"</span>,i);

  printf(<span style="font-style: italic;">"after the sort \n"</span>);
  <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> =1 ; i &lt; argc; i++) {
    printf(<span style="font-style: italic;">"%d\n"</span>,f[i-1]);
 }


  free(f);
  <span style="font-weight: bold;">return</span> 0;
}


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org13b2fb6" class="outline-2">
<h2 id="org13b2fb6">Longest Substring Without Repeating Characters</h2>
<div class="outline-text-2" id="text-org13b2fb6">
</div>
