Algorithm.org
** python
#+begin_src ipython :results output :exports both
class Solution:
    def lengthOfLongestSubstring(self, s):
        hashmap = {}
        lastindex = 0
        maxlen = 0
        for i in range(len(s)):
            if s[i] in hashmap:
                lastindex = max(lastindex, hashmap[s[i]]+1)
            maxlen = max(maxlen, i-lastindex+1)
            hashmap[s[i]] = i
        return maxlen

ss = Solution()

print(ss.lengthOfLongestSubstring("abcabcbb"))
print(ss.lengthOfLongestSubstring("abcdefkj"))
print(ss.lengthOfLongestSubstring("abc"))
print(ss.lengthOfLongestSubstring("pwwkew"))
print(ss.lengthOfLongestSubstring("abb"))
print(ss.lengthOfLongestSubstring("abba"))
#+end_src

#+RESULTS:
: 3
: 8
: 3
: 3
: 2
: 2

* k-way Merge
** description
L1, L2...Lk are all sorted array with n elements,
will be mereged into one sorted array
** Naive merge
#+begin_src 

merge L1 with L2 get l2
merge l2 with L3 get l3
...
Time Compexity $$\Theta(n \cdot logk)$$
#+end_src
** rund merge
#+begin_src 
L1 with L2 for l2
L3 with L4 for l4
...
L2 with L4 for l4
...
#+end_src
** Heap merge
build a heap with k element, which are from
each array L,
extract Max-Heap, and rebuild the Heap, in 
removed array L with new (next) element
* Dynamic program
** Description
变量类型， 坐标， 限标
都可以是一维或者多维
在状态转移函数中自己影响自己

* Maximum subarray
|-----+---------------+----------------------------------------------------------|
| A1. | $O(n^3)$      | Erschöpfende Suche/ Brute-Force-Suche/ Exhaustive Search |
|-----+---------------+----------------------------------------------------------|
| A2. | $O(n^2)$      | Zwischen Prozessen mehr anwenden                         |
|-----+---------------+----------------------------------------------------------|
| A3. | $O(n \log n)$ | Rekursive                                                |
|-----+---------------+----------------------------------------------------------|
| A4. | $O(n)$        | Max Maxsuffix                                            |
|-----+---------------+----------------------------------------------------------|
** blunt force $O(n^{3})$
#+begin_src 
A[a] for = 0 to n-1
max -> -Infty
for i = 1 to n
  for j = i to n
    for k = i to j
      sum = sum+A[k]
    if sum > max:
      max = sum
return max
#+end_src

** iterative based $O(n^{2})$
#+begin_src 
A[a] for a = 0 to n-1
max = -Infty
for i = 1 to n:
  sum = 0
  for j = i to n:
    sum = sum + A[j]
  if sum > max:
    max = sum
return max
#+end_src

** dynamic programmierung $O(n)$
#+begin_src 
A[a] for a = 0 to n-1
max = - Infty
init array S with n elemenets 0
S[0] = A[0]
for i = 1 to n-1:
  S[i] = max{S[i-1]+A[i], A[i]}
  if S[i] > max:
    max = S[i]
return max
#+end_src
*** Algorithm
#+begin_src 
A[a] for a = 0 to n-1
max = 0
Stmp = 0
for i = 1 to n-1:
  Stmp = max{Stmp+A[i], A[i]}
  if Stmp > max:
    max = Stmp
return max
#+end_src

*** C/C++
#+begin_src C :results output :exports both
  int main(int argc, char *argv[])
  {
    int MaxSubArray(int A[], int N){
      int i, b = 0, maxsum = 0;
      for (i = 0; i < N; ++i) {
        if (b > 0) {
          b += A[i];
        }else{
          b = A[i];
        }
        if (b > maxsum) {
          maxsum = b;
        }
      }
      return maxsum;
    }
  
    int A[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19, 23, 45,78};
    int length = sizeof(A)/sizeof(int);
    int max = MaxSubArray(A, length);
    printf("%d \n",max);
    return 0;
  }

#+end_src

#+RESULTS:
: 24794
* maximum submatrix 
