Algorithm.html
<div id="outline-container-org2797c6c" class="outline-3">
<h3 id="org2797c6c">python</h3>
<div class="outline-text-3" id="text-org2797c6c">
<div class="org-src-container">
<pre class="src src-ipython">class Solution:
    def lengthOfLongestSubstring(self, s):
	hashmap = {}
	lastindex = 0
	maxlen = 0
	for i in range(len(s)):
	    if s[i] in hashmap:
		lastindex = max(lastindex, hashmap[s[i]]+1)
	    maxlen = max(maxlen, i-lastindex+1)
	    hashmap[s[i]] = i
	return maxlen

ss = Solution()

print(ss.lengthOfLongestSubstring("abcabcbb"))
print(ss.lengthOfLongestSubstring("abcdefkj"))
print(ss.lengthOfLongestSubstring("abc"))
print(ss.lengthOfLongestSubstring("pwwkew"))
print(ss.lengthOfLongestSubstring("abb"))
print(ss.lengthOfLongestSubstring("abba"))
</pre>
</div>

<pre class="example">
3
8
3
3
2
2

</pre>
</div>
</div>
</div>

<div id="outline-container-org55a4c7e" class="outline-2">
<h2 id="org55a4c7e">k-way Merge</h2>
<div class="outline-text-2" id="text-org55a4c7e">
</div>
<div id="outline-container-org926d628" class="outline-3">
<h3 id="org926d628">description</h3>
<div class="outline-text-3" id="text-org926d628">
<p>
L1, L2&#x2026;Lk are all sorted array with n elements,
will be mereged into one sorted array
</p>
</div>
</div>
<div id="outline-container-orgb49d8f5" class="outline-3">
<h3 id="orgb49d8f5">Naive merge</h3>
<div class="outline-text-3" id="text-orgb49d8f5">
<pre class="example">

merge L1 with L2 get l2
merge l2 with L3 get l3
...
Time Compexity $$\Theta(n \cdot logk)$$
</pre>
</div>
</div>
<div id="outline-container-org8e2e608" class="outline-3">
<h3 id="org8e2e608">rund merge</h3>
<div class="outline-text-3" id="text-org8e2e608">
<pre class="example">
L1 with L2 for l2
L3 with L4 for l4
...
L2 with L4 for l4
...
</pre>
</div>
</div>
<div id="outline-container-orgb4f7272" class="outline-3">
<h3 id="orgb4f7272">Heap merge</h3>
<div class="outline-text-3" id="text-orgb4f7272">
<p>
build a heap with k element, which are from
each array L,
extract Max-Heap, and rebuild the Heap, in 
removed array L with new (next) element
</p>
</div>
</div>
</div>
<div id="outline-container-orge191e5f" class="outline-2">
<h2 id="orge191e5f">Dynamic program</h2>
<div class="outline-text-2" id="text-orge191e5f">
</div>
<div id="outline-container-orgcfd96df" class="outline-3">
<h3 id="orgcfd96df">Description</h3>
<div class="outline-text-3" id="text-orgcfd96df">
<p>
变量类型， 坐标， 限标
都可以是一维或者多维
在状态转移函数中自己影响自己
</p>
</div>
</div>
</div>

<div id="outline-container-orgb9bdf79" class="outline-2">
<h2 id="orgb9bdf79">Maximum subarray</h2>
<div class="outline-text-2" id="text-orgb9bdf79">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">A1.</th>
<th scope="col" class="org-left">\(O(n^3)\)</th>
<th scope="col" class="org-left">Erschöpfende Suche/ Brute-Force-Suche/ Exhaustive Search</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A2.</td>
<td class="org-left">\(O(n^2)\)</td>
<td class="org-left">Zwischen Prozessen mehr anwenden</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">A3.</td>
<td class="org-left">\(O(n \log n)\)</td>
<td class="org-left">Rekursive</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">A4.</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">Max Maxsuffix</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org519eeb3" class="outline-3">
<h3 id="org519eeb3">blunt force \(O(n^{3})\)</h3>
<div class="outline-text-3" id="text-org519eeb3">
<pre class="example">
A[a] for = 0 to n-1
max -&gt; -Infty
for i = 1 to n
  for j = i to n
    for k = i to j
      sum = sum+A[k]
    if sum &gt; max:
      max = sum
return max
</pre>
</div>
</div>

<div id="outline-container-orgdb6b339" class="outline-3">
<h3 id="orgdb6b339">iterative based \(O(n^{2})\)</h3>
<div class="outline-text-3" id="text-orgdb6b339">
<pre class="example">
A[a] for a = 0 to n-1
max = -Infty
for i = 1 to n:
  sum = 0
  for j = i to n:
    sum = sum + A[j]
  if sum &gt; max:
    max = sum
return max
</pre>
</div>
</div>

<div id="outline-container-org12ef379" class="outline-3">
<h3 id="org12ef379">dynamic programmierung \(O(n)\)</h3>
<div class="outline-text-3" id="text-org12ef379">
<pre class="example">
A[a] for a = 0 to n-1
max = - Infty
init array S with n elemenets 0
S[0] = A[0]
for i = 1 to n-1:
  S[i] = max{S[i-1]+A[i], A[i]}
  if S[i] &gt; max:
    max = S[i]
return max
</pre>
</div>
<div id="outline-container-org616f937" class="outline-4">
<h4 id="org616f937">Algorithm</h4>
<div class="outline-text-4" id="text-org616f937">
<pre class="example">
A[a] for a = 0 to n-1
max = 0
Stmp = 0
for i = 1 to n-1:
  Stmp = max{Stmp+A[i], A[i]}
  if Stmp &gt; max:
    max = Stmp
return max
</pre>
</div>
</div>

<div id="outline-container-org9b0c3fd" class="outline-4">
<h4 id="org9b0c3fd">C/C++</h4>
<div class="outline-text-4" id="text-org9b0c3fd">
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[])
{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">MaxSubArray</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[], <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">N</span>){
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; font-style: italic;">b</span> = 0, <span style="font-weight: bold; font-style: italic;">maxsum</span> = 0;
    <span style="font-weight: bold;">for</span> (i = 0; i &lt; N; ++i) {
      <span style="font-weight: bold;">if</span> (b &gt; 0) {
        b += A[i];
      }<span style="font-weight: bold;">else</span>{
        b = A[i];
      }
      <span style="font-weight: bold;">if</span> (b &gt; maxsum) {
        maxsum = b;
      }
    }
    <span style="font-weight: bold;">return</span> maxsum;
  }

  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">A</span>[] = {2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9, 45, 9,34, 23,345, 546,20, 23465, 90, 19, 23, 45,78};
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">length</span> = <span style="font-weight: bold;">sizeof</span>(A)/<span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">max</span> = MaxSubArray(A, length);
  printf(<span style="font-style: italic;">"%d \n"</span>,max);
  <span style="font-weight: bold;">return</span> 0;
}

</pre>
</div>

<pre class="example">
24794

</pre>
</div>
</div>
</div>
</div>
