Algorithm.org
** Brute force solution 
#+begin_src 
list all submatrix,
sum = 0 
for xstart -> 0,1...l:
    for xstop -> xstart+1, xstart+2...l:
        for ystart -> 0, 1, 2....l:
            for ystop -> ystart+1, ystart+2...l:
                for x -> xstart .... xstop:
                    for y -> ystart .... ystop:
                       sumsub += A[x][y]
                if sumsub > sum:
                   sum = sumsub
#+end_src

#+begin_src ipython :results output
  import random
  import numpy
  def maxsublist(arr, n):
      b = 0
      sumlist = 0
      for j in range(n):
          if b > 0:
              b += arr[j]
          else:
              b = arr[j]
          if b > sumlist:
              sumlist = b
      return sumlist


  def maxsubmatrix(A, l):
      Acolmun = np.zeros(l)
      summaxtrix = 0
      for i in range(l):
          if summaxtrix > 0:
              Acolmun += A[i,:]
              sumlist = maxsublist(Acolmun, l)
              print(Acolmun)
              print("the maximum sublist is: {}".format(sumlist))
              print("the maximum submatrix is: {}".format(summaxtrix))
          else:
              Acolmun = A[i,:]
              sumlist = maxsublist(Acolmun, l)
              print(Acolmun)
              print("the maximum sublist is: {}".format(sumlist))
              print("the maximum submatrix is: {}".format(summaxtrix))
          if sumlist > summaxtrix:
              summaxtrix = sumlist
      return summaxtrix

  import random
  l = 8
  a = [[]]*l
  gsm = [[]]*l
  #initialization a random matrix with shape of 8x8
  for i in range(l):
      a[i] = [random.randint(-5, 5) for x in range(l)]

  print("Original random matrix  \n")
  a = np.array(a)
  print(a)
  max = 0
  for i in range(1, l):
      for xstart in range(i-1, l):                            # x start  of submatrix
          for xstop in range(i+xstart, l+1-i+1):              # x stop    of submatrix
              for j in range(1, l):
                  for ystart in range(j-1, l):                 # y start of submatrix
                      for ystop in range(j+ystart, l+1-j+1):   # y stop of submatrix
                          lip = [[] for x in range(l)]
                          count = 0
                          for x in range(xstart, xstop):
                              for y in range(ystart, ystop):
                                  lip[x].append(a[x][y])
                                  count += a[x][y]
                          # if (xstart ==6 and xstop == 8 and ystart == 6 and ystop == 8): #test small submatrix
                          #     print (count);

                          if count > max:
                              lipmax = [[] for x in range(l)]
                              max = count
                              lipmax = lip
  print("maximux submatrix :\n")
  lipmax = np.array(lipmax)
  for i in range(len(lipmax)):
      print("\n")
      for j in lipmax[i]:
          print("{:>4d}".format(j), end="")

  print("\n")
  print("The summary is ", max)
  print("with dynamic programmierung is {}".format(maxsubmatrix(a, l)))

#+end_src

#+RESULTS:
#+begin_example
Original random matrix  

[[ 4  2  0 -2  5 -3  2  1]
 [-5 -2  5  1  4  2 -4  0]
 [-4  1  3  1  3  0  2  3]
 [ 4  2 -1  1  2 -3 -5 -1]
 [-4 -3 -4  2  3  1 -4 -3]
 [ 2  0  5 -5 -2  5 -5  5]
 [-3 -5  5  4  3  1 -4  2]
 [-2 -3  5  2  1  2 -3 -5]]
-10
maximux submatrix :



   0  -2   5  -3

   5   1   4   2

   3   1   3   0

  -1   1   2  -3

  -4   2   3   1

   5  -5  -2   5

   5   4   3   1

   5   2   1   2

The summary is  46
[ 4  2  0 -2  5 -3  2  1]
the maximum sublist is: 9
the maximum submatrix is: 0
[-1  0  5 -1  9 -1 -2  1]
the maximum sublist is: 13
the maximum submatrix is: 9
[-5  1  8  0 12 -1  0  4]
the maximum sublist is: 24
the maximum submatrix is: 13
[-1  3  7  1 14 -4 -5  3]
the maximum sublist is: 25
the maximum submatrix is: 24
[-5  0  3  3 17 -3 -9  0]
the maximum sublist is: 23
the maximum submatrix is: 25
[ -3   0   8  -2  15   2 -14   5]
the maximum sublist is: 23
the maximum submatrix is: 25
[ -6  -5  13   2  18   3 -18   7]
the maximum sublist is: 36
the maximum submatrix is: 25
[ -8  -8  18   4  19   5 -21   2]
the maximum sublist is: 46
the maximum submatrix is: 36
with dynamic programmierung is 46
#+end_example

** dynamic programmierung
#+begin_src ipython :results output :exports both
  import random
  import numpy as np

  def maxsublist(arr, n):
      b = 0
      sumlist = 0
      for j in range(n):
          if b > 0:
              b += arr[j]
          else:
              b = arr[j]
          if b > sumlist:
              sumlist = b
      return sumlist

  def maxsubmatrix(A, l):
      Acolmun = np.zeros(l)
      summaxtrix = 0
      for i in range(l):
          if summaxtrix > 0:
              Acolmun += A[i,:]
              sumlist = maxsublist(Acolmun, l)
          else:
              Acolmun = A[i,:]
              sumlist = maxsublist(Acolmun, l)
          if sumlist > summaxtrix:
              summaxtrix = sumlist
      return summaxtrix
  l = 8
  A = [[]]*l
  for i in range(l):
      A[i] = [random.randint(-5, 5) for x in range(l)]
  A = np.array(A)
  print(A)
  print(maxsubmatrix(A, l))    
#+end_src

#+RESULTS:
: [[ 5 -2  3  4 -1  4 -3  4]
:  [ 2 -1  1 -2 -1  2 -4 -5]
:  [ 2 -4  0  5 -4  5  3  4]
:  [ 3 -5 -2 -2  1 -4  4 -3]
:  [ 5 -2  5  4 -2  4 -3  0]
:  [ 5 -2  0  4 -4 -1  3  4]
:  [-3 -4 -3  1  1 -3 -5  4]
:  [ 4  3  5 -5  0 -3 -2  0]]
: 29

* Find the sum of a specific value in a list
在一个列表中找到一个特定数值的和
** Python
*** with recursive
#+begin_src ipython :results output :exports both
  arr = [3, 34, 4, 12, 5, 2]
  def res_subset(arr, i, s):
      if s == 0:
          return True
      elif i == 0:
          return arr[0] == s
      elif arr[i] > s:
          return res_subset(arr, i-1, s)
      else:
          A = res_subset(arr, i-1, s-arr[i])
          B = res_subset(arr, i-1, s)
          return A or B
 print(res_subset(arr, len(arr)-1, 9))
 print(res_subset(arr, len(arr)-1, 10))
 print(res_subset(arr, len(arr)-1, 11))
 print(res_subset(arr, len(arr)-1, 12))
 print(res_subset(arr, len(arr)-1, 13))

#+end_src

#+RESULTS:
: True
: True
: True
: True
: False

*** without rekursive
#+begin_src ipython :results output :exports both
  import numpy as np
  arr = [3, 34, 4, 12, 5, 2]
  target = 13
  result = np.zeros((len(arr), target+1), dtype = bool)
  result[: , 0] = True
  result[0 , :] = False
  result[0 , arr[0]] = True
  for i in range(1, len(arr)):
      for j in range(1, target+1):
          if arr[i] > j:
              result[i, j] = result[i-1, j]
          else:
              A = result[i-1, j-arr[i]]
              B = result[i-1, j]
              result[i, j] = A or B
  print(result[-1][-1])            
            
#+end_src

#+RESULTS:
: False

* Langest increasing subsequence (LIS)
