Algorithm.html
<div id="outline-container-org82d61e2" class="outline-2">
<h2 id="org82d61e2">maximum submatrix</h2>
<div class="outline-text-2" id="text-org82d61e2">
</div>
<div id="outline-container-orgb5d3e04" class="outline-3">
<h3 id="orgb5d3e04">Brute force solution</h3>
<div class="outline-text-3" id="text-orgb5d3e04">
<pre class="example">
list all submatrix,
sum = 0 
for xstart -&gt; 0,1...l:
    for xstop -&gt; xstart+1, xstart+2...l:
	for ystart -&gt; 0, 1, 2....l:
	    for ystop -&gt; ystart+1, ystart+2...l:
		for x -&gt; xstart .... xstop:
		    for y -&gt; ystart .... ystop:
		       sumsub += A[x][y]
		if sumsub &gt; sum:
		   sum = sumsub
</pre>

<div class="org-src-container">
<pre class="src src-ipython">import random
import numpy
def maxsublist(arr, n):
    b = 0
    sumlist = 0
    for j in range(n):
	if b &gt; 0:
	    b += arr[j]
	else:
	    b = arr[j]
	if b &gt; sumlist:
	    sumlist = b
    return sumlist


def maxsubmatrix(A, l):
    Acolmun = np.zeros(l)
    summaxtrix = 0
    for i in range(l):
	if summaxtrix &gt; 0:
	    Acolmun += A[i,:]
	    sumlist = maxsublist(Acolmun, l)
	    print(Acolmun)
	    print("the maximum sublist is: {}".format(sumlist))
	    print("the maximum submatrix is: {}".format(summaxtrix))
	else:
	    Acolmun = A[i,:]
	    sumlist = maxsublist(Acolmun, l)
	    print(Acolmun)
	    print("the maximum sublist is: {}".format(sumlist))
	    print("the maximum submatrix is: {}".format(summaxtrix))
	if sumlist &gt; summaxtrix:
	    summaxtrix = sumlist
    return summaxtrix

import random
l = 8
a = [[]]*l
gsm = [[]]*l
#initialization a random matrix with shape of 8x8
for i in range(l):
    a[i] = [random.randint(-5, 5) for x in range(l)]

print("Original random matrix  \n")
a = np.array(a)
print(a)
max = 0
for i in range(1, l):
    for xstart in range(i-1, l):                            # x start  of submatrix
	for xstop in range(i+xstart, l+1-i+1):              # x stop    of submatrix
	    for j in range(1, l):
		for ystart in range(j-1, l):                 # y start of submatrix
		    for ystop in range(j+ystart, l+1-j+1):   # y stop of submatrix
			lip = [[] for x in range(l)]
			count = 0
			for x in range(xstart, xstop):
			    for y in range(ystart, ystop):
				lip[x].append(a[x][y])
				count += a[x][y]
			# if (xstart ==6 and xstop == 8 and ystart == 6 and ystop == 8): #test small submatrix
			#     print (count);

			if count &gt; max:
			    lipmax = [[] for x in range(l)]
			    max = count
			    lipmax = lip
print("maximux submatrix :\n")
lipmax = np.array(lipmax)
for i in range(len(lipmax)):
    print("\n")
    for j in lipmax[i]:
	print("{:&gt;4d}".format(j), end="")

print("\n")
print("The summary is ", max)
print("with dynamic programmierung is {}".format(maxsubmatrix(a, l)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgee544d2" class="outline-3">
<h3 id="orgee544d2">dynamic programmierung</h3>
<div class="outline-text-3" id="text-orgee544d2">
<div class="org-src-container">
<pre class="src src-ipython">import random
import numpy as np

def maxsublist(arr, n):
    b = 0
    sumlist = 0
    for j in range(n):
	if b &gt; 0:
	    b += arr[j]
	else:
	    b = arr[j]
	if b &gt; sumlist:
	    sumlist = b
    return sumlist

def maxsubmatrix(A, l):
    Acolmun = np.zeros(l)
    summaxtrix = 0
    for i in range(l):
	if summaxtrix &gt; 0:
	    Acolmun += A[i,:]
	    sumlist = maxsublist(Acolmun, l)
	else:
	    Acolmun = A[i,:]
	    sumlist = maxsublist(Acolmun, l)
	if sumlist &gt; summaxtrix:
	    summaxtrix = sumlist
    return summaxtrix
l = 8
A = [[]]*l
for i in range(l):
    A[i] = [random.randint(-5, 5) for x in range(l)]
A = np.array(A)
print(A)
print(maxsubmatrix(A, l))    
</pre>
</div>

<pre class="example">
[[ 5 -2  3  4 -1  4 -3  4]
 [ 2 -1  1 -2 -1  2 -4 -5]
 [ 2 -4  0  5 -4  5  3  4]
 [ 3 -5 -2 -2  1 -4  4 -3]
 [ 5 -2  5  4 -2  4 -3  0]
 [ 5 -2  0  4 -4 -1  3  4]
 [-3 -4 -3  1  1 -3 -5  4]
 [ 4  3  5 -5  0 -3 -2  0]]
29

</pre>
</div>
</div>
</div>

<div id="outline-container-orge80fbc2" class="outline-2">
<h2 id="orge80fbc2">Find the sum of a specific value in a list</h2>
<div class="outline-text-2" id="text-orge80fbc2">
<p>
在一个列表中找到一个特定数值的和
</p>
</div>
<div id="outline-container-org3cb1eb7" class="outline-3">
<h3 id="org3cb1eb7">Python</h3>
<div class="outline-text-3" id="text-org3cb1eb7">
</div>
<div id="outline-container-org4f68138" class="outline-4">
<h4 id="org4f68138">with recursive</h4>
<div class="outline-text-4" id="text-org4f68138">
<div class="org-src-container">
<pre class="src src-ipython"> arr = [3, 34, 4, 12, 5, 2]
 def res_subset(arr, i, s):
     if s == 0:
	 return True
     elif i == 0:
	 return arr[0] == s
     elif arr[i] &gt; s:
	 return res_subset(arr, i-1, s)
     else:
	 A = res_subset(arr, i-1, s-arr[i])
	 B = res_subset(arr, i-1, s)
	 return A or B
print(res_subset(arr, len(arr)-1, 9))
print(res_subset(arr, len(arr)-1, 10))
print(res_subset(arr, len(arr)-1, 11))
print(res_subset(arr, len(arr)-1, 12))
print(res_subset(arr, len(arr)-1, 13))

</pre>
</div>

<pre class="example">
True
True
True
True
False

</pre>
</div>
</div>

<div id="outline-container-org591b056" class="outline-4">
<h4 id="org591b056">without rekursive</h4>
<div class="outline-text-4" id="text-org591b056">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
arr = [3, 34, 4, 12, 5, 2]
target = 13
result = np.zeros((len(arr), target+1), dtype = bool)
result[: , 0] = True
result[0 , :] = False
result[0 , arr[0]] = True
for i in range(1, len(arr)):
    for j in range(1, target+1):
	if arr[i] &gt; j:
	    result[i, j] = result[i-1, j]
	else:
	    A = result[i-1, j-arr[i]]
	    B = result[i-1, j]
	    result[i, j] = A or B
print(result[-1][-1])            

</pre>
</div>

<pre class="example">
False

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5e893d" class="outline-2">
<h2 id="orgb5e893d">Langest increasing subsequence (LIS)</h2>
<div class="outline-text-2" id="text-orgb5e893d">
</div>
