Algorithm.org
** Python
#+begin_src python :results output
list1 = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
l = len(list1)
a = [1]*l
b = [[] for x in range(l)]

for i in range(l):
    for j in range(i):
        if (list1[i] > list1[j]) and (a[i] < (a[j] + 1)):
            a[i] = a[j]+1
            b[i].append(list1[j])
    b[i].append(list1[i])

print(a)
maxa = a.index(max(a))
print("the maximun length of LIS of list1 is {}".format(max(a)))
print("the LIS is {}".format(b[maxa]))

#+end_src

#+RESULTS:
: [1, 1, 2, 3, 4, 5, 6, 4, 3, 4, 2, 5, 6, 7, 3, 8]
: the maximun length of LIS of list1 is 8
: the LIS is [2, 3, 4, 5, 6, 7, 8, 9]

#+begin_src python :results output
  list1 = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
  l = len(list1)
  a = [1]*l
  
  for i in range(l):
      for j in range(i):
          if (list1[i] > list1[j]):
              a[i] = max(a[i], a[j]+1)
  print(a)
  print("the maximun length of LIS of list1 is {}".format(max(a)))
#+end_src

#+RESULTS:
: [1, 1, 2, 3, 4, 5, 6, 4, 3, 4, 2, 5, 6, 7, 3, 8]
: the maximun length of LIS of list1 is 8

* packsack
** 0-1 sack
$dp[i][j] = max(dp[i-1][j], dp[i-1][j-A[i]] + V[i])$
** complete sack
k is the total number, if 背包全放每一种时的最大份数
$dp[i][j] = max(dp[i-1][j], dp[i-1][j-k*A[i]] + k*V[i])$
** bund sack
n is the bunded number for each variante
$dp[i][j] = max(dp[i-1][j], dp[i-1][j-n*A[i]] + n*V[i])$

* Order Statistics
** description
#+begin_src 
For Array a[i], i from 0 to n-1
we want to find the the k-th biggest element in linear time
1-th biggest is the minimun
n-1-th biggest is the maximum
#+end_src
** for minimun and maximum
normal iterative:  need 2n-2, each n-1
2 terms iterative:
#+begin_src 
(min_1, max_1) <- (a[0],a[1])
(min_2, max_2) <- (a[2],a[3])
(min_3, max_3) <- (a[4],a[5])
...
(min_n/2, max_n/2) <- (a[n-2],a[n-1])

min = min_1, max = max_1
for i from 2 to n/2:
    if min_i < min:
        min = min_i
    if max_i > max:
        max = max_i
return min, max
#+end_src
