Algorithm.html
<div id="outline-container-orgfc2a331" class="outline-3">
<h3 id="orgfc2a331">Python</h3>
<div class="outline-text-3" id="text-orgfc2a331">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">list1</span> = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
<span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">len</span>(list1)
<span style="font-weight: bold; font-style: italic;">a</span> = [1]*l
<span style="font-weight: bold; font-style: italic;">b</span> = [[] <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(l)]

<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(l):
    <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(i):
        <span style="font-weight: bold;">if</span> (list1[i] &gt; list1[j]) <span style="font-weight: bold;">and</span> (a[i] &lt; (a[j] + 1)):
            <span style="font-weight: bold; font-style: italic;">a</span>[i] = a[j]+1
            b[i].append(list1[j])
    b[i].append(list1[i])

<span style="font-weight: bold;">print</span>(a)
<span style="font-weight: bold; font-style: italic;">maxa</span> = a.index(<span style="font-weight: bold;">max</span>(a))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"the maximun length of LIS of list1 is {}"</span>.<span style="font-weight: bold;">format</span>(<span style="font-weight: bold;">max</span>(a)))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"the LIS is {}"</span>.<span style="font-weight: bold;">format</span>(b[maxa]))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">list1</span> = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
<span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">len</span>(list1)
<span style="font-weight: bold; font-style: italic;">a</span> = [1]*l

<span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(l):
    <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(i):
        <span style="font-weight: bold;">if</span> (list1[i] &gt; list1[j]):
            <span style="font-weight: bold; font-style: italic;">a</span>[i] = <span style="font-weight: bold;">max</span>(a[i], a[j]+1)
<span style="font-weight: bold;">print</span>(a)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"the maximun length of LIS of list1 is {}"</span>.<span style="font-weight: bold;">format</span>(<span style="font-weight: bold;">max</span>(a)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3861c64" class="outline-2">
<h2 id="org3861c64">packsack</h2>
<div class="outline-text-2" id="text-org3861c64">
</div>
<div id="outline-container-org815e670" class="outline-3">
<h3 id="org815e670">0-1 sack</h3>
<div class="outline-text-3" id="text-org815e670">
<p>
\(dp[i][j] = max(dp[i-1][j], dp[i-1][j-A[i]] + V[i])\)
</p>
</div>
</div>
<div id="outline-container-org7b51555" class="outline-3">
<h3 id="org7b51555">complete sack</h3>
<div class="outline-text-3" id="text-org7b51555">
<p>
k is the total number, if 背包全放每一种时的最大份数
\(dp[i][j] = max(dp[i-1][j], dp[i-1][j-k*A[i]] + k*V[i])\)
</p>
</div>
</div>
<div id="outline-container-org4587518" class="outline-3">
<h3 id="org4587518">bund sack</h3>
<div class="outline-text-3" id="text-org4587518">
<p>
n is the bunded number for each variante
\(dp[i][j] = max(dp[i-1][j], dp[i-1][j-n*A[i]] + n*V[i])\)
</p>
</div>
</div>
</div>

<div id="outline-container-org7909c5e" class="outline-2">
<h2 id="org7909c5e">Order Statistics</h2>
<div class="outline-text-2" id="text-org7909c5e">
</div>
<div id="outline-container-orgc4598bc" class="outline-3">
<h3 id="orgc4598bc">description</h3>
<div class="outline-text-3" id="text-orgc4598bc">
<pre class="example">
For Array a[i], i from 0 to n-1
we want to find the the k-th biggest element in linear time
1-th biggest is the minimun
n-1-th biggest is the maximum
</pre>
</div>
</div>
<div id="outline-container-org0036558" class="outline-3">
<h3 id="org0036558">for minimun and maximum</h3>
<div class="outline-text-3" id="text-org0036558">
<p>
normal iterative:  need 2n-2, each n-1
2 terms iterative:
</p>
<pre class="example">
(min_1, max_1) &lt;- (a[0],a[1])
(min_2, max_2) &lt;- (a[2],a[3])
(min_3, max_3) &lt;- (a[4],a[5])
...
(min_n/2, max_n/2) &lt;- (a[n-2],a[n-1])

min = min_1, max = max_1
for i from 2 to n/2:
    if min_i &lt; min:
	min = min_i
    if max_i &gt; max:
	max = max_i
return min, max
</pre>
</div>
</div>
