Algorithm.org
** linear approach
index: i
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
|1  |2  |3  |4  |5  |6  |7  |8  |9  |10 |11 |12 |13 |14 |15 |16 |17 |18 |19 |20 |21 |22 |23 |24 |
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+

array a[]:
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
|2  |14 |6  |27 |4  |67 |24 |9  |16 |45 |26 |17 |20 |8  |41 |23 |34 |5  |36 |77 |44 |3  |25 |22 |
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
looking for the k-th biggest elemenet


divide array a[] into length/5 groups, each group has 5 elemenets, and the last is not required to be 5

+---+    +---+  +---+  +---+  +---+
|2  |    |67 |  |26 |  |23 |  |44 |
+---+    +---+  +---+  +---+  +---+
|14 |    |24 |  |17 |  |34 |  |3  |
+---+    +---+  +---+  +---+  +---+
|6  |    |9  |  |20 |  |5  |  |25 |
+---+    +---+  +---+  +---+  +---+
|27 |    |16 |  |8  |  |36 |  |22 |
+---+    +---+  +---+  +---+  +---+
|4  |    |45 |  |41 |  |77 |  |   |
+---+    +---+  +---+  +---+  +---+

sort all group with insert sorting

+---+  +---+  +---+  +---+  +---+
|2  |  |9  |  |8  |  |5  |  |3  |
+---+  +---+  +---+  +---+  +---+
|4  |  |16 |  |17 |  |23 |  |22 |
+---+  +---+  +---+  +---+  +---+
|6  |  |24 |  |20 |  |34 |  |25 |
+---+  +---+  +---+  +---+  +---+
|14 |  |45 |  |26 |  |36 |  |44 |
+---+  +---+  +---+  +---+  +---+
|27 |  |67 |  |41 |  |77 |  |   |
+---+  +---+  +---+  +---+  +---+


get  the mediums of each group

+---+---+---+---+---+
|6  |24 |20 |34 |25 |
+---+---+---+---+---+

if at this step, the number of elemenets are more than 5, recursive spilt again

sort group

+---+---+---+---+---+
|6  |20 |24 |25 |34 |
+---+---+---+---+---+

get the medium 24. at spilt the array a[] with this element a[7]=24.

if k==7 return 24

if k< 7 looking for k-th biggest elemenet in
+---+---+---+---+---+---+
|2  |14 |6  |27 |4  |67 |
+---+---+---+---+---+---+

if k> 7 looking for the (k-16)-th biggest elemenet in
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
|9  |16 |45 |26 |17 |20 |8  |41 |23 |34 |5  |36 |77 |44 |3  |25 |22 |
+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+

