Algorithm.html
<div id="outline-container-org75ab358" class="outline-3">
<h3 id="org75ab358">linear approach</h3>
<div class="outline-text-3" id="text-org75ab358">
<p>
index: i
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      1&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      2&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      3&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      4&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      5&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      6&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      7&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      8&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      9&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      10&nbsp;
    </td>
    <td align="left" valign="top">
      11&nbsp;
    </td>
    <td align="left" valign="top">
      12&nbsp;
    </td>
    <td align="left" valign="top">
      13&nbsp;
    </td>
    <td align="left" valign="top">
      14&nbsp;
    </td>
    <td align="left" valign="top">
      15&nbsp;
    </td>
    <td align="left" valign="top">
      16&nbsp;
    </td>
    <td align="left" valign="top">
      17&nbsp;
    </td>
    <td align="left" valign="top">
      18&nbsp;
    </td>
    <td align="left" valign="top">
      19&nbsp;
    </td>
    <td align="left" valign="top">
      20&nbsp;
    </td>
    <td align="left" valign="top">
      21&nbsp;
    </td>
    <td align="left" valign="top">
      22&nbsp;
    </td>
    <td align="left" valign="top">
      23&nbsp;
    </td>
    <td align="left" valign="top">
      24&nbsp;
    </td>
  </tr>
</table>

<p>
array a[]:
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      2&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      14&nbsp;
    </td>
    <td align="left" valign="top">
      6&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      27&nbsp;
    </td>
    <td align="left" valign="top">
      4&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      67&nbsp;
    </td>
    <td align="left" valign="top">
      24&nbsp;
    </td>
    <td align="left" valign="top">
      9&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      16&nbsp;
    </td>
    <td align="left" valign="top">
      45&nbsp;
    </td>
    <td align="left" valign="top">
      26&nbsp;
    </td>
    <td align="left" valign="top">
      17&nbsp;
    </td>
    <td align="left" valign="top">
      20&nbsp;
    </td>
    <td align="left" valign="top">
      8&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      41&nbsp;
    </td>
    <td align="left" valign="top">
      23&nbsp;
    </td>
    <td align="left" valign="top">
      34&nbsp;
    </td>
    <td align="left" valign="top">
      5&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      36&nbsp;
    </td>
    <td align="left" valign="top">
      77&nbsp;
    </td>
    <td align="left" valign="top">
      44&nbsp;
    </td>
    <td align="left" valign="top">
      3&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      25&nbsp;
    </td>
    <td align="left" valign="top">
      22&nbsp;
    </td>
  </tr>
</table>
<p>
looking for the k-th biggest elemenet
</p>


<p>
divide array a[] into length/5 groups, each group has 5 elemenets, and the last is not required to be 5
</p>

<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">67</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">26</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">23</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">44</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">24</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">17</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">34</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">9</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">20</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">25</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">27</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">36</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">45</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">41</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">77</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>    <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>

<p>
sort all group with insert sorting
</p>

<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">9</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">17</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">23</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">24</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">20</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">34</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">25</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">45</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">26</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">36</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">44</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">27</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">67</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">41</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">77</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>


<p>
get  the mediums of each group
</p>

<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      6&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      24&nbsp;
    </td>
    <td align="left" valign="top">
      20&nbsp;
    </td>
    <td align="left" valign="top">
      34&nbsp;
    </td>
    <td align="left" valign="top">
      25&nbsp;
    </td>
  </tr>
</table>

<p>
if at this step, the number of elemenets are more than 5, recursive spilt again
</p>

<p>
sort group
</p>

<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      6&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      20&nbsp;
    </td>
    <td align="left" valign="top">
      24&nbsp;
    </td>
    <td align="left" valign="top">
      25&nbsp;
    </td>
    <td align="left" valign="top">
      34&nbsp;
    </td>
  </tr>
</table>

<p>
get the medium 24. at spilt the array a[] with this element a[7]=24.
</p>

<p>
if k==7 return 24
</p>

<p>
if k&lt; 7 looking for k-th biggest elemenet in
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      2&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      14&nbsp;
    </td>
    <td align="left" valign="top">
      6&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      27&nbsp;
    </td>
    <td align="left" valign="top">
      4&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      67&nbsp;
    </td>
  </tr>
</table>

<p>
if k&gt; 7 looking for the (k-16)-th biggest elemenet in
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      9&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      16&nbsp;
    </td>
    <td align="left" valign="top">
      45&nbsp;
    </td>
    <td align="left" valign="top">
      26&nbsp;
    </td>
    <td align="left" valign="top">
      17&nbsp;
    </td>
    <td align="left" valign="top">
      20&nbsp;
    </td>
    <td align="left" valign="top">
      8&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      41&nbsp;
    </td>
    <td align="left" valign="top">
      23&nbsp;
    </td>
    <td align="left" valign="top">
      34&nbsp;
    </td>
    <td align="left" valign="top">
      5&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      36&nbsp;
    </td>
    <td align="left" valign="top">
      77&nbsp;
    </td>
    <td align="left" valign="top">
      44&nbsp;
    </td>
    <td align="left" valign="top">
      3&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      25&nbsp;
    </td>
    <td align="left" valign="top">
      22&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
