Algorithm.org
** complexity
no matter for k > i (i = 7, a[7]=24), we can exculsive the black position
+---+   +---+  +---+  +---+  +---+
|2  |   |8  |  |9  |  |3  |  |5  |
+---+   +---+  +---+  +---+  +---+
|4  |   |17 |  |16 |  |22 |  |23 |
+---+   +---+  +---+  +---+  +---+
|6  |   |20 |  |24 |  |25 |  |34 |
+---+   +---+  +---+  +---+  +---+
|14 |   |26 |  |45 |  |44 |  |36 |
+---+   +---+  +---+  +---+  +---+
|27 |   |41 |  |67 |  |   |  |77 |
+---+   +---+  +---+  +---+  +---+

+---+   +---+  +---+  +---+  +---+
|   |   |   |  |   |  |3  |  |5  |
+---+   +---+  +---+  +---+  +---+
|   |   |   |  |   |  |22 |  |23 |
+---+   +---+  +---+  +---+  +---+
|   |   |   |  |   |  |25 |  |34 |
+---+   +---+  +---+  +---+  +---+
|14 |   |26 |  |45 |  |44 |  |36 |
+---+   +---+  +---+  +---+  +---+
|27 |   |41 |  |67 |  |   |  |77 |
+---+   +---+  +---+  +---+  +---+

$$ \frac{3}{5} \cdot \frac{n}{2} + O(1) = \frac{3n}{10} + O(1)$$ elements are definitely excluded

The recursive format is
$$ T(n) = T(\frac{n}{5}) + T(\frac{7n}{10}+6) + O(n)$$
$$T(n) = O(n)$$
* Range Minimun Query
** description
#+begin_src
array A[i] for i from 0 to n-1
given two number j, k, so 0 < i< j<n-1
return the minimun elements of range A[j]...A[k]
#+end_src
** naiv approach
#+begin_src
min = A[0]
for n from 0 to n-2:
  for m from 1 to n-1:
    for o from n to m:
      if A[o] < min:
        min = A[o]
#+end_src
obviously the time compexity is $O(n^{3})$
** DP naiv approach
with Dynamic Program to iterative scan.
#+begin_src
set M[n][n] as empty matrix to save RMQ of array A[n].
M[i][i] = A[i]
for i from 0 to n-2:
  M[i][j] = A[i]        if A[i] < M[i-1][j]
          = M[i-1][j]   otherwise
  for j from 1 to n-1:
    M[i][j] = A[j]        if A[j] < M[i][j-1]
            = M[i][j-1]   otherwise
#+end_src
obviously the time compexity is $O(n^{2})$

** addation M approach
set K=ceiling ($log_2^n$)

set M´[i][k] = RMQ(i, i+2^k-1)


---o-------------------oo------------------------o------

---+i

-----------------------+$i+2^{k-1}-1$

------------------------+$i+2^{k-1}$

--------------------------------------------------+$i+2^k-1$

#+begin_src 
M´[*][1] = RMQ(i, i+1)
for i from 0 to n-1:
  for k from 2 to K:
    M´[i][k] = M´[i][k-1]           if A[M´[i][k-1]] < A[M´[i+2^{k-1}][k-1]] 
             = M´[i+2^{k-1}][k-1]   otherwise
#+end_src

get RMQ(i,j)

s = floor(log^{j-i})

---o------------0-------o------------------------o------

---i

----------------j-2^s+1

------------------------i+2^s-1

-------------------------------------------------j
#+begin_src 
for i to i+2^s-1: M´[i][s]
for j-2^s-1 to j: M´[j-2^s-1][s]
RMQ(i,j)= A[M´[i][s]]      if  A[M´[i][s]] < A[M´[j-2^s-1][s]]
        = M´[j-2^s-1][s]   otherwise
#+end_src
the time compexity is $O(n \cdot log^{n})$
