Algorithm.html

<div id="outline-container-org7cfc4d9" class="outline-3">
<h3 id="org7cfc4d9">complexity</h3>
<div class="outline-text-3" id="text-org7cfc4d9">
<p>
no matter for k &gt; i (i = 7, a[7]=24), we can exculsive the black position
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">9</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">17</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">22</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">23</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">20</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">24</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">25</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">34</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">26</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">45</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">44</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">36</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">27</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">41</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">67</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">77</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>

<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">22</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">23</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">25</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">34</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">14</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">26</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">45</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">44</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">36</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">27</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">41</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">67</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">77</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>   <del>---</del>  <del>---</del>  <del>---</del>  <del>---</del>
</p>

<p>
\[ \frac{3}{5} \cdot \frac{n}{2} + O(1) = \frac{3n}{10} + O(1)\] elements are definitely excluded
</p>

<p>
The recursive format is
\[ T(n) = T(\frac{n}{5}) + T(\frac{7n}{10}+6) + O(n)\]
\[T(n) = O(n)\]
</p>
</div>
</div>
</div>
<div id="outline-container-org1cac2f0" class="outline-2">
<h2 id="org1cac2f0">Range Minimun Query</h2>
<div class="outline-text-2" id="text-org1cac2f0">
</div>
<div id="outline-container-org0e819c5" class="outline-3">
<h3 id="org0e819c5">description</h3>
<div class="outline-text-3" id="text-org0e819c5">
<pre class="example">
array A[i] for i from 0 to n-1
given two number j, k, so 0 &lt; i&lt; j&lt;n-1
return the minimun elements of range A[j]...A[k]
</pre>
</div>
</div>
<div id="outline-container-org805f1c7" class="outline-3">
<h3 id="org805f1c7">naiv approach</h3>
<div class="outline-text-3" id="text-org805f1c7">
<pre class="example">
min = A[0]
for n from 0 to n-2:
  for m from 1 to n-1:
    for o from n to m:
      if A[o] &lt; min:
	min = A[o]
</pre>
<p>
obviously the time compexity is \(O(n^{3})\)
</p>
</div>
</div>
<div id="outline-container-org40988c9" class="outline-3">
<h3 id="org40988c9">DP naiv approach</h3>
<div class="outline-text-3" id="text-org40988c9">
<p>
with Dynamic Program to iterative scan.
</p>
<pre class="example">
set M[n][n] as empty matrix to save RMQ of array A[n].
M[i][i] = A[i]
for i from 0 to n-2:
  M[i][j] = A[i]        if A[i] &lt; M[i-1][j]
	  = M[i-1][j]   otherwise
  for j from 1 to n-1:
    M[i][j] = A[j]        if A[j] &lt; M[i][j-1]
	    = M[i][j-1]   otherwise
</pre>
<p>
obviously the time compexity is \(O(n^{2})\)
</p>
</div>
</div>

<div id="outline-container-orgfbebe2c" class="outline-3">
<h3 id="orgfbebe2c">addation M approach</h3>
<div class="outline-text-3" id="text-orgfbebe2c">
<p>
set K=ceiling (\(log_2^n\))
</p>

<p>
set M´[i][k] = RMQ(i, i+2<sup>k</sup>-1)
</p>


<p>
&#x2014;o--------------&#x2013;&#x2014;oo-------------------&#x2013;&#x2014;o-&#x2013;&#x2014;
</p>

<p>
&#x2014;+i
</p>

<p>
------------------&#x2013;&#x2014;+\(i+2^{k-1}-1\)
</p>

<p>
-------------------&#x2013;&#x2014;+\(i+2^{k-1}\)
</p>

<p>
---------------------------------------------&#x2013;&#x2014;+\(i+2^k-1\)
</p>

<pre class="example">
M´[*][1] = RMQ(i, i+1)
for i from 0 to n-1:
  for k from 2 to K:
    M´[i][k] = M´[i][k-1]           if A[M´[i][k-1]] &lt; A[M´[i+2^{k-1}][k-1]] 
	     = M´[i+2^{k-1}][k-1]   otherwise
</pre>

<p>
get RMQ(i,j)
</p>

<p>
s = floor(log<sup>j-i</sup>)
</p>

<p>
&#x2014;o-------&#x2013;&#x2014;0--&#x2013;&#x2014;o-------------------&#x2013;&#x2014;o-&#x2013;&#x2014;
</p>

<p>
&#x2014;i
</p>

<p>
-----------&#x2013;&#x2014;j-2<sup>s</sup>+1
</p>

<p>
-------------------&#x2013;&#x2014;i+2<sup>s</sup>-1
</p>

<p>
--------------------------------------------&#x2013;&#x2014;j
</p>
<pre class="example">
for i to i+2^s-1: M´[i][s]
for j-2^s-1 to j: M´[j-2^s-1][s]
RMQ(i,j)= A[M´[i][s]]      if  A[M´[i][s]] &lt; A[M´[j-2^s-1][s]]
	= M´[j-2^s-1][s]   otherwise
</pre>
<p>
the time compexity is \(O(n \cdot log^{n})\)
</p>
</div>
</div>
