Algorithm.org
** partional approach
Array A[n]

+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+
|  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+

spilt Array A into block size of  $s = floor(\frac{log^n}{2})$
we have n/s blocks
+--+--+--+--+   +--+--+--+--+  +--+--+--+--+  +--+--+--+--+  +--+--+--+--+
|  |  |  |  |   |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |
+--+--+--+--+   +--+--+--+--+  +--+--+--+--+  +--+--+--+--+  +--+--+--+--+

we build 2 array h[n/s] and pos[n/s]
h[n/s]:  contains the minimum element of each block
+--+--+--+--+--+
|  |  |  |  |  |
+--+--+--+--+--+

pos[n/s]: contains the position of the corresponding elements in h when it is still in A.
+--+--+--+--+--+
|  |  |  |  |  |
+--+--+--+--+--+


#+begin_src 
For RMQ(i, j)
i´ = i/s+1
j´ = j/s
l = RMQ_h(i´, j´)
pos[l] = RMQ(i´s, j´s-1)

but the RMQ can still be in [i...i´s] or [j´s...j]
so l´ = RMQ[i, i´s] and
l´´ = RMQ[j´s, j]
return min(l, l´, l´´)
#+end_src

Now comes the question, how to get l´ and l´´ in constant time (in a block)?
this can only be solved in special situation

** ($\pm 1$)RMQ

it called Normalisation.

normalise all block  (x,[....]) to (0,x) where $x \in (-1, +1)^{s}$

for one block, there are $2^{s}$ permutation of -1 and +1,

this have time compexity $O(2^{s}) = O(\sqrt{n})$

and we compute all permutation probability into a sxs matrix.

for all RMQ query in this block can be saved in this matrix.

this have time compexity of $s^{2}$

all together we habe $O(2^{s} \cdot s^{2}) = O(n)$


oooo--------ooooo--------ooooo-----ooooo------oooooo------ooooooo
|           |            |                                 |
(0, $x_1$)     (0,$x_2$)       (0, $x_3$)                           (0,$x_{n/s}$)
$m_x_{1}$         $m_{x_{2}}$         $m_{x_{3}}$                               $m_{x_{n/s}}$
$M_x_{1}$         $M_{x_{2}}$         $M_{x_{3}}$                               $M_{x_{n/s}}$

(0,x) normalisation
$m_x$: performance
$M_x$: sxs matrix for permutation

for query of RMQ in a block, auch as for l´ = RMQ[i, i´s], we find the
representation of i, i´s in $m_x$, we can get the corresponding RMQ

** ($\pm 1$)RMQ for LCA in rooted tree
#+begin_src 
for a rooted tree, we want to find the Lowest Common Ancestor.
for two node u and v, we want to find the common ancestor of u and v
and most far away from its root.
#+end_src

#+begin_src 
for the rooted tree, we do the preprcess to get the following 3 array
E[*] (Euler tour) list all the node in tree with DFS, (2n-1) elements
L[*] the level of each element in E, this comply with the $\pm$1 property
R[*] each element position when they are first time occur in E R[i]= min(E[j]=i|1<j<2n)
#+end_src

#+begin_src
find the u and v in R,
in R get the corresponding positions in E, get the range from u position to v position
find the min in L with the same range  we get in E, and return the position of minimum in L
get the LCA in E with the position we get in L
#+end_src

LCA(u, v) -> RMQ_L(E[R[u]], E[R[v]])

** Cartesian tree
#+begin_src 
this tree has two property,
1, it's a heap, which mean, the parents are all smaller than their childen
2, we can get the original array with the IN-order scan of the tree
#+end_src

#+begin_src 
How to build cartesian tree
for inserting a new node, we compare it to the root and the rightest edge,
if it is smaller than the root, trun the all(include the root) to be new node's left child
if it is bigger, go down to the next node, if go to the leaf, add it just as right child
if it is bigger, go down to the next node, if it is smaller than one node,
                                           trun all to be the left child, and new node as right chilc
#+end_src
this can be done in $O(n)$ time compexity
** LCA and RMQ

$$RMQ_{A}(i, j) = LCA_{T_{A}}(i,j)$$
where $T_{A}$ is the cartesian tree of A
the root of subtree, which contains i and j, is the RMQ(i,j)

* Computional Geometry
** Convex combinations
all points p(x, y) between  $p_{1} (x_{1}, y_{1})$ and $p_{2}(x_{2}, y_{2})$,
x1< x < x2 and y1 < y < y2




** Cross Product
$p_{1} \times p_{2} = det$ $\begin{pmatrix} 0 & 1 \\ 1 & 0 \end{pmatrix}$ $=x_{1}y_{2} - x_{2}y_{1}$
cross Product = (sign) * (Aera of Parallelogram）

sign is +: p1 is clockweise from p2 with respect of their common origin, from p1 to (p2-p1) trun to right 
sign is -: p1 is connterclockweise from p2 with respect of their common origin, from p1 to (p2-p1) trun to left


*** Application of intersection

Direction: $d (p_{i}, p_{j}, p_{k}) = (p_{k}-p_{i}) \times (p_{j}-p_{i})$
On-Segment: if one end-point of one Segment is convex combinations of the other Segment

Algorithm:  first check if  two segments straddles, $d1 \cdot d2 < 0$ and $d3 \cdot d4 < 0$
                        else if any d = 0, check if On-segment
                        otherwise return No


