Algorithm.html
<div id="outline-container-orga3c8b61" class="outline-3">
<h3 id="orga3c8b61">partional approach</h3>
<div class="outline-text-3" id="text-orga3c8b61">
<p>
Array A[n]
</p>

<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
spilt Array A into block size of  \(s = floor(\frac{log^n}{2})\)
we have n/s blocks
<del>--</del>--<del>--</del>&#x2013;+   <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>--</del>--<del>--</del>&#x2013;+   <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+  <del>--</del>--<del>--</del>&#x2013;+
</p>

<p>
we build 2 array h[n/s] and pos[n/s]
h[n/s]:  contains the minimum element of each block
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
pos[n/s]: contains the position of the corresponding elements in h when it is still in A.
</p>
<!-- This HTML table template is generated by emacs 26.3 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;
    </td>
  </tr>
</table>


<pre class="example">
For RMQ(i, j)
i´ = i/s+1
j´ = j/s
l = RMQ_h(i´, j´)
pos[l] = RMQ(i´s, j´s-1)

but the RMQ can still be in [i...i´s] or [j´s...j]
so l´ = RMQ[i, i´s] and
l´´ = RMQ[j´s, j]
return min(l, l´, l´´)
</pre>

<p>
Now comes the question, how to get l´ and l´´ in constant time (in a block)?
this can only be solved in special situation
</p>
</div>
</div>

<div id="outline-container-org9e44ade" class="outline-3">
<h3 id="org9e44ade">(\(\pm 1\))RMQ</h3>
<div class="outline-text-3" id="text-org9e44ade">
<p>
it called Normalisation.
</p>

<p>
normalise all block  (x,[&#x2026;.]) to (0,x) where \(x \in (-1, +1)^{s}\)
</p>

<p>
for one block, there are \(2^{s}\) permutation of -1 and +1,
</p>

<p>
this have time compexity \(O(2^{s}) = O(\sqrt{n})\)
</p>

<p>
and we compute all permutation probability into a sxs matrix.
</p>

<p>
for all RMQ query in this block can be saved in this matrix.
</p>

<p>
this have time compexity of \(s^{2}\)
</p>

<p>
all together we habe \(O(2^{s} \cdot s^{2}) = O(n)\)
</p>


<p>
oooo---&#x2013;&#x2014;ooooo---&#x2013;&#x2014;ooooo&#x2013;&#x2014;ooooo-&#x2013;&#x2014;oooooo-&#x2013;&#x2014;ooooooo
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
(0, \(x_1\))     (0,\(x_2\))       (0, \(x_3\))                           (0,\(x_{n/s}\))
\(m_x_{1}\)         \(m_{x_{2}}\)         \(m_{x_{3}}\)                               \(m_{x_{n/s}}\)
\(M_x_{1}\)         \(M_{x_{2}}\)         \(M_{x_{3}}\)                               \(M_{x_{n/s}}\)
</p>

<p>
(0,x) normalisation
\(m_x\): performance
\(M_x\): sxs matrix for permutation
</p>

<p>
for query of RMQ in a block, auch as for l´ = RMQ[i, i´s], we find the
representation of i, i´s in \(m_x\), we can get the corresponding RMQ
</p>
</div>
</div>

<div id="outline-container-org279bfd3" class="outline-3">
<h3 id="org279bfd3">(\(\pm 1\))RMQ for LCA in rooted tree</h3>
<div class="outline-text-3" id="text-org279bfd3">
<pre class="example">
for a rooted tree, we want to find the Lowest Common Ancestor.
for two node u and v, we want to find the common ancestor of u and v
and most far away from its root.
</pre>

<pre class="example">
for the rooted tree, we do the preprcess to get the following 3 array
E[*] (Euler tour) list all the node in tree with DFS, (2n-1) elements
L[*] the level of each element in E, this comply with the $\pm$1 property
R[*] each element position when they are first time occur in E R[i]= min(E[j]=i|1&lt;j&lt;2n)
</pre>

<pre class="example">
find the u and v in R,
in R get the corresponding positions in E, get the range from u position to v position
find the min in L with the same range  we get in E, and return the position of minimum in L
get the LCA in E with the position we get in L
</pre>

<p>
LCA(u, v) -&gt; RMQ<sub>L</sub>(E[R[u]], E[R[v]])
</p>
</div>
</div>

<div id="outline-container-org802b22e" class="outline-3">
<h3 id="org802b22e">Cartesian tree</h3>
<div class="outline-text-3" id="text-org802b22e">
<pre class="example">
this tree has two property,
1, it's a heap, which mean, the parents are all smaller than their childen
2, we can get the original array with the IN-order scan of the tree
</pre>

<pre class="example">
How to build cartesian tree
for inserting a new node, we compare it to the root and the rightest edge,
if it is smaller than the root, trun the all(include the root) to be new node's left child
if it is bigger, go down to the next node, if go to the leaf, add it just as right child
if it is bigger, go down to the next node, if it is smaller than one node,
					   trun all to be the left child, and new node as right chilc
</pre>
<p>
this can be done in \(O(n)\) time compexity
</p>
</div>
</div>
<div id="outline-container-org10bd7c5" class="outline-3">
<h3 id="org10bd7c5">LCA and RMQ</h3>
<div class="outline-text-3" id="text-org10bd7c5">
<p>
\[RMQ_{A}(i, j) = LCA_{T_{A}}(i,j)\]
where \(T_{A}\) is the cartesian tree of A
the root of subtree, which contains i and j, is the RMQ(i,j)
</p>
</div>
</div>
</div>

<div id="outline-container-org64d9e17" class="outline-2">
<h2 id="org64d9e17">Computional Geometry</h2>
<div class="outline-text-2" id="text-org64d9e17">
</div>
<div id="outline-container-orge0337a6" class="outline-3">
<h3 id="orge0337a6">Convex combinations</h3>
<div class="outline-text-3" id="text-orge0337a6">
<p>
all points p(x, y) between  \(p_{1} (x_{1}, y_{1})\) and \(p_{2}(x_{2}, y_{2})\),
x1&lt; x &lt; x2 and y1 &lt; y &lt; y2
</p>
</div>
</div>




<div id="outline-container-org06be857" class="outline-3">
<h3 id="org06be857">Cross Product</h3>
<div class="outline-text-3" id="text-org06be857">
<p>
\(p_{1} \times p_{2} = det\) \(\begin{pmatrix} 0 & 1 \\ 1 & 0 \end{pmatrix}\) \(=x_{1}y_{2} - x_{2}y_{1}\)
cross Product = (sign) * (Aera of Parallelogram）
</p>

<p>
sign is +: p1 is clockweise from p2 with respect of their common origin, from p1 to (p2-p1) trun to right 
sign is -: p1 is connterclockweise from p2 with respect of their common origin, from p1 to (p2-p1) trun to left
</p>
</div>


<div id="outline-container-orgc09f05a" class="outline-4">
<h4 id="orgc09f05a">Application of intersection</h4>
<div class="outline-text-4" id="text-orgc09f05a">
<p>
Direction: \(d (p_{i}, p_{j}, p_{k}) = (p_{k}-p_{i}) \times (p_{j}-p_{i})\)
On-Segment: if one end-point of one Segment is convex combinations of the other Segment
</p>

<p>
Algorithm:  first check if  two segments straddles, \(d1 \cdot d2 < 0\) and \(d3 \cdot d4 < 0\)
                        else if any d = 0, check if On-segment
                        otherwise return No
</p>
</div>
</div>
