Algorithm.org
*** Application of Polar Angle

$p_{1} \times p_{2} = det$ $\begin{pmatrix} 0 & 1 \\ 1 & 0 \end{pmatrix}$ $=x_{1}y_{2} - x_{2}y_{1} > 0$
the sign is positive, p1 to p2 have right trun,

The Polar Angle is p1 < p2

** Sweeping
Check if any two Segments intersect in a Segments Set

sort endpoints of the segments in S from left to right, breaking ties by putting left
endpoints before right endpoints, and then by y -coordinates.
#+begin_src
T = ∅;
for each point p in the sorted list of endpoints:
    if p is the left endpoint of a segment s
        Insert(s, T )
        if (Above(s, T ) exists and intersects s) or  (Below(s, T ) exists and intersects s)
            return TRUE

    if p is the right endpoint of a segment s
        if both Above(s, T ) and Below(s, T ) exist and Above(s, T ) and Below(s, T ) intersect
            return TRUE

     Delete(s, T )
return FALSE

#+end_src

** Convex Hull
For a Set of points <p0...pn>, we want to find the small Hull, to cover all points.
*** Graham's Scan
let p0 is the smallest y value in set, and Sorted all other points counterclockweise
with their polar angle: $O(n logn)$
#+begin_src
let S = empty stack
push (p0, S), Push(p1, S), Push(p2, S)
for i from 3 to n:
    while from nextTop(S), Top(S) to pi trun left:
        pop (S)
    push(pi)
return S
#+end_src
This take $O(n)$

*** Jarvis's march
We roll the Paper until we find the point with smallest polar angle,
Build a Sequence H, start with p0 just like in Graham's Scan(with smallest y value in Set
#+begin_src
start with p0, find the next vertex p1 with smallest polar angle with respect to p0
start with p1, find the next vertex p2 with smallest polar angle with respect to p1
start with p2, find the next vertex p3 with smallest polar angle with respect to p2
...
when we reach the highest y-value vertex,left chain is finished, start to right chain,
But from the negative x-axis, until we come back to p0

#+end_src
This take $O(nh)$

