Algorithm.html


<div id="outline-container-org6277286" class="outline-4">
<h4 id="org6277286">Application of Polar Angle</h4>
<div class="outline-text-4" id="text-org6277286">
<p>
\(p_{1} \times p_{2} = det\) \(\begin{pmatrix} 0 & 1 \\ 1 & 0 \end{pmatrix}\) \(=x_{1}y_{2} - x_{2}y_{1} > 0\)
the sign is positive, p1 to p2 have right trun,
</p>

<p>
The Polar Angle is p1 &lt; p2
</p>
</div>
</div>
</div>

<div id="outline-container-org4c2a511" class="outline-3">
<h3 id="org4c2a511">Sweeping</h3>
<div class="outline-text-3" id="text-org4c2a511">
<p>
Check if any two Segments intersect in a Segments Set
</p>

<p>
sort endpoints of the segments in S from left to right, breaking ties by putting left
endpoints before right endpoints, and then by y -coordinates.
</p>
<pre class="example">
T = ∅;
for each point p in the sorted list of endpoints:
    if p is the left endpoint of a segment s
	Insert(s, T )
	if (Above(s, T ) exists and intersects s) or  (Below(s, T ) exists and intersects s)
	    return TRUE

    if p is the right endpoint of a segment s
	if both Above(s, T ) and Below(s, T ) exist and Above(s, T ) and Below(s, T ) intersect
	    return TRUE

     Delete(s, T )
return FALSE

</pre>
</div>
</div>

<div id="outline-container-org7b99820" class="outline-3">
<h3 id="org7b99820">Convex Hull</h3>
<div class="outline-text-3" id="text-org7b99820">
<p>
For a Set of points &lt;p0&#x2026;pn&gt;, we want to find the small Hull, to cover all points.
</p>
</div>
<div id="outline-container-orge563c96" class="outline-4">
<h4 id="orge563c96">Graham's Scan</h4>
<div class="outline-text-4" id="text-orge563c96">
<p>
let p0 is the smallest y value in set, and Sorted all other points counterclockweise
with their polar angle: \(O(n logn)\)
</p>
<pre class="example">
let S = empty stack
push (p0, S), Push(p1, S), Push(p2, S)
for i from 3 to n:
    while from nextTop(S), Top(S) to pi trun left:
	pop (S)
    push(pi)
return S
</pre>
<p>
This take \(O(n)\)
</p>
</div>
</div>

<div id="outline-container-org87f00f6" class="outline-4">
<h4 id="org87f00f6">Jarvis's march</h4>
<div class="outline-text-4" id="text-org87f00f6">
<p>
We roll the Paper until we find the point with smallest polar angle,
Build a Sequence H, start with p0 just like in Graham's Scan(with smallest y value in Set
</p>
<pre class="example">
start with p0, find the next vertex p1 with smallest polar angle with respect to p0
start with p1, find the next vertex p2 with smallest polar angle with respect to p1
start with p2, find the next vertex p3 with smallest polar angle with respect to p2
...
when we reach the highest y-value vertex,left chain is finished, start to right chain,
But from the negative x-axis, until we come back to p0

</pre>
<p>
This take \(O(nh)\)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-01-23 Sun 14:25</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
